1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);

    for (int i = 0; i < 3; i++) {
        m_filter[i].a0 = 1;
        m_filter[i].a1 = 0;
        m_filter[i].a2 = 0;
        m_filter[i].b1 = 0;
        m_filter[i].b2 = 0;
    }

    computeLimit(); // first init, vol = 21, vol_steps = 21
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setBufsize(int rambuf_sz, int psrambuf_sz)
{
    if (InBuff.isInitialized()) {
        log_e("AudioHelpr::setBufsize must not be called after audio is initialized");
        return;
    }
    InBuff.setBufsize(rambuf_sz, psrambuf_sz);
};

void AudioHelpr::initInBuff()
{
    if (!InBuff.isInitialized()) {
        size_t size = InBuff.init();
        if (size > 0) {
            AUDIO_INFO("PSRAM %sfound, inputBufferSize: %u bytes", InBuff.havePSRAM() ? "" : "not ", size - 1);
        }
    }
    changeMaxBlockSize(1600); // default size mp3 or aac
}

//---------------------------------------------------------------------------------------------------------------------
esp_err_t AudioHelpr::I2Sstart(uint8_t i2s_num)
{
    // It is not necessary to call this function after i2s_driver_install() (it is started automatically),
    // however it is necessary to call it after i2s_stop()
    return i2s_start((i2s_port_t)i2s_num);
}

esp_err_t AudioHelpr::I2Sstop(uint8_t i2s_num)
{
    return i2s_stop((i2s_port_t)i2s_num);
}
//---------------------------------------------------------------------------------------------------------------------
esp_err_t AudioHelpr::i2s_mclk_pin_select(const uint8_t pin)
{
    // IDF >= 4.4 use setPinout(BCLK, LRC, DOUT, DIN, MCK) only, i2s_mclk_pin_select() is no longer needed

    if (pin != 0 && pin != 1 && pin != 3) {
        log_e("Only support GPIO0/GPIO1/GPIO3, gpio_num:%d", pin);
        return ESP_ERR_INVALID_ARG;
    }

#ifdef CONFIG_IDF_TARGET_ESP32
    switch (pin) {
    case 0:
        PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0_CLK_OUT1);
        WRITE_PERI_REG(PIN_CTRL, 0xFFF0);
        break;
    case 1:
        PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0TXD_U, FUNC_U0TXD_CLK_OUT3);
        WRITE_PERI_REG(PIN_CTRL, 0xF0F0);
        break;
    case 3:
        PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0RXD_U, FUNC_U0RXD_CLK_OUT2);
        WRITE_PERI_REG(PIN_CTRL, 0xFF00);
        break;
    default:
        break;
    }
#endif

    return ESP_OK;
}
//---------------------------------------------------------------------------------------------------------------------
AudioHelpr::~AudioHelpr()
{
    // I2Sstop(m_i2s_num);
    // InBuff.~AudioBuffer(); #215 the AudioBuffer is automatically destroyed by the destructor
    setDefaults();
    if (m_playlistBuff) {
        free(m_playlistBuff);
        m_playlistBuff = NULL;
    }
    i2s_driver_uninstall((i2s_port_t)m_i2s_num); // #215 free I2S buffer
    if (m_chbuf) {
        free(m_chbuf);
        m_chbuf = NULL;
    }
    if (m_lastHost) {
        free(m_lastHost);
        m_lastHost = NULL;
    }
    if (m_outBuff) {
        free(m_outBuff);
        m_outBuff = NULL;
    }
    if (m_ibuff) {
        free(m_ibuff);
        m_ibuff = NULL;
    }
    vSemaphoreDelete(mutex_audio);
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setDefaults()
{
    stopSong();
    initInBuff(); // initialize InputBuffer if not already done
    InBuff.resetBuffer();
    MP3Decoder_FreeBuffers();
    // FLACDecoder_FreeBuffers();
    // AACDecoder_FreeBuffers();
    // OPUSDecoder_FreeBuffers();
    // VORBISDecoder_FreeBuffers();
    if (m_playlistBuff) {
        free(m_playlistBuff);
        m_playlistBuff = NULL;
    } // free if stream is not m3u8
    vector_clear_and_shrink(m_playlistURL);
    vector_clear_and_shrink(m_playlistContent);
    m_hashQueue.clear();
    m_hashQueue.shrink_to_fit(); // uint32_t vector
    client.stop();
    clientsecure.stop();
    _client = static_cast<WiFiClient *>(&client); /* default to *something* so that no NULL deref can happen */
    ts_parsePacket(0, 0, 0);                      // reset ts routine

    AUDIO_INFO("buffers freed, free Heap: %u bytes", ESP.getFreeHeap());

    m_f_chunked = false; // Assume not chunked
    m_f_firstmetabyte = false;
    m_f_playing = false;
    m_f_ssl = false;
    m_f_metadata = false;
    m_f_tts = false;
    m_f_firstCall = true; // InitSequence for processWebstream and processLokalFile
    m_f_running = false;
    m_f_loop = false;     // Set if audio file should loop
    m_f_unsync = false;   // set within ID3 tag but not used
    m_f_exthdr = false;   // ID3 extended header
    m_f_rtsp = false;     // RTSP (m3u8)stream
    m_f_m3u8data = false; // set again in processM3U8entries() if necessary
    m_f_continue = false;
    m_f_ts = false;
    m_f_m4aID3dataAreRead = false;

    isplaying = 0;
    m_streamType = ST_NONE;
    m_codec = CODEC_NONE;
    m_playlistFormat = FORMAT_NONE;
    m_datamode = AUDIO_NONE;
    m_audioCurrentTime = 0; // Reset playtimer
    m_audioFileDuration = 0;
    m_audioDataStart = 0;
    m_audioDataSize = 0;
    m_avr_bitrate = 0;     // the same as m_bitrate if CBR, median if VBR
    m_bitRate = 0;         // Bitrate still unknown
    m_bytesNotDecoded = 0; // counts all not decodable bytes
    m_chunkcount = 0;      // for chunked streams
    m_contentlength = 0;   // If Content-Length is known, count it
    m_curSample = 0;
    m_metaint = 0;        // No metaint yet
    m_LFcount = 0;        // For end of header detection
    m_controlCounter = 0; // Status within readID3data() and readWaveHeader()
    m_channels = 2;       // assume stereo #209
    m_streamTitleHash = 0;
    m_file_size = 0;
    m_ID3Size = 0;
}

//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl)
{
    if (timeout_ms)
        m_timeout_ms = timeout_ms;
    if (timeout_ms_ssl)
        m_timeout_ms_ssl = timeout_ms_ssl;
}

