1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    char rqh[strlen(h_host) + 200]; // http request header
    rqh[0] = '\0';

    strcat(rqh, "GET ");
    strcat(rqh, extension);
    strcat(rqh, " HTTP/1.1\r\n");
    strcat(rqh, "Host: ");
    strcat(rqh, hostwoext);
    strcat(rqh, "\r\n");
    strcat(rqh, "Accept-Encoding: identity;q=1,*;q=0\r\n");
    //    strcat(rqh, "User-Agent: Mozilla/5.0\r\n"); #363
    strcat(rqh, "Connection: keep-alive\r\n\r\n");

    if (m_f_ssl) {
        _client = static_cast<WiFiClient *>(&clientsecure);
        if (port == 8080)
            port = 443;
    } else {
        _client = static_cast<WiFiClient *>(&client);
    }

    if (!_client->connected()) {
        AUDIO_INFO("The host has disconnected, reconnecting");
        if (!_client->connect(hostwoext, port)) {
            log_e("connection lost");
            stopSong();
            return false;
        }
    }
    _client->print(rqh);

    if (endsWith(extension, ".mp3"))
        m_expectedCodec = CODEC_MP3;
    if (endsWith(extension, ".aac"))
        m_expectedCodec = CODEC_AAC;
    if (endsWith(extension, ".wav"))
        m_expectedCodec = CODEC_WAV;
    if (endsWith(extension, ".m4a"))
        m_expectedCodec = CODEC_M4A;
    if (endsWith(extension, ".flac"))
        m_expectedCodec = CODEC_FLAC;
    if (endsWith(extension, ".asx"))
        m_expectedPlsFmt = FORMAT_ASX;
    if (endsWith(extension, ".m3u"))
        m_expectedPlsFmt = FORMAT_M3U;
    if (endsWith(extension, ".m3u8"))
        m_expectedPlsFmt = FORMAT_M3U8;
    if (endsWith(extension, ".pls"))
        m_expectedPlsFmt = FORMAT_PLS;

    setDatamode(HTTP_RESPONSE_HEADER); // Handle header
    m_streamType = ST_WEBSTREAM;
    m_contentlength = 0;
    m_f_chunked = false;

    if (hostwoext) {
        free(hostwoext);
        hostwoext = NULL;
    }
    if (extension) {
        free(extension);
        extension = NULL;
    }
    if (h_host) {
        free(h_host);
        h_host = NULL;
    }
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setFileLoop(bool input)
{
    if (m_codec == CODEC_M4A)
        return 0;
    m_f_loop = input;
    return input;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::UTF8toASCII(char *str)
{

    const uint8_t ascii[60] = {
        // 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148  // UTF8(C3)
        //                ?    ?    ?    ?         ?                                       ?                  // CHAR
        000, 000, 000, 142, 143, 146, 128, 000, 144, 000, 000, 000, 000, 000, 000, 000, 165, 000, 000, 000, // ASCII
                                                                                                            // 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168
        //      ?                             ?              ?    à                   ?    ?    ?         è
        000, 153, 000, 000, 000, 000, 000, 154, 000, 000, 225, 133, 000, 000, 000, 132, 134, 145, 000, 138,
        // 169, 170, 171, 172. 173. 174. 175, 176, 177, 179, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188
        //      ê    ?    ì         ?    ?         ?    ò         ?         ?              ù         ?    ü
        000, 136, 137, 141, 000, 140, 139, 000, 164, 149, 000, 147, 000, 148, 000, 000, 151, 000, 150, 129};

    uint16_t i = 0, j = 0, s = 0;
    bool f_C3_seen = false;

    while (str[i] != 0) {    // convert UTF8 to ASCII
        if (str[i] == 195) { // C3
            i++;
            f_C3_seen = true;
            continue;
        }
        str[j] = str[i];
        if (str[j] > 128 && str[j] < 189 && f_C3_seen == true) {
            s = ascii[str[j] - 129];
            if (s != 0)
                str[j] = s; // found a related ASCII sign
            f_C3_seen = false;
        }
        i++;
        j++;
    }
    str[j] = 0;
}

void AudioHelpr::printProcessLog(int r, const char *s)
{
    const char *e;
    const char *f = "";
    uint8_t logLevel; // 1 Error, 2 Warn, 3 Info,
    switch (r) {
    case AUDIOLOG_PATH_IS_NULL:
        e = "The path ore file name is empty";
        logLevel = 1;
        break;
    case AUDIOLOG_OUT_OF_MEMORY:
        e = "Out of memory";
        logLevel = 1;
        break;
    case AUDIOLOG_FILE_NOT_FOUND:
        e = "File doesn't exist: ";
        logLevel = 1;
        f = s;
        break;
    case AUDIOLOG_FILE_READ_ERR:
        e = "Failed to open file for reading";
        logLevel = 1;
        break;

    default:
        e = "UNKNOWN EVENT";
        logLevel = 3;
        break;
    }
    if (audio_log) {
        audio_log(logLevel, e, f);
    } else {
        if (logLevel == 1) {
            AUDIO_INFO("ERROR: %s%s", e, f);
        } else if (logLevel == 2) {
            AUDIO_INFO("WARNING: %s%s", e, f);
        } else {
            AUDIO_INFO("INFO: %s%s", e, f);
        }
    }
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::connecttoFS(fs::FS &fs, const char *path, int32_t fileStartPos)
{

    if (!path) { // guard
        printProcessLog(AUDIOLOG_PATH_IS_NULL);
        return false;
    }

    xSemaphoreTakeRecursive(mutex_audio, portMAX_DELAY); // #3

    m_fileStartPos = fileStartPos;
    setDefaults(); // free buffers an set defaults

    char *audioPath = (char *)__malloc_heap_psram(strlen(path) + 2);
    if (!audioPath) {
        printProcessLog(AUDIOLOG_OUT_OF_MEMORY);
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }
    if (path[0] == '/') {
        strcpy(audioPath, path);
    } else {
        audioPath[0] = '/';
        strcpy(audioPath + 1, path);
    }

    if (!fs.exists(audioPath)) {
        UTF8toASCII(audioPath);
        if (!fs.exists(audioPath)) {
            printProcessLog(AUDIOLOG_FILE_NOT_FOUND, audioPath);
            xSemaphoreGiveRecursive(mutex_audio);
            free(audioPath);
            return false;
        }
    }

    AUDIO_INFO("Reading file: \"%s\"", audioPath);
    audiofile = fs.open(audioPath);

