1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (!audiofile) {
        printProcessLog(AUDIOLOG_FILE_READ_ERR, audioPath);
        free(audioPath);
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }

    setDatamode(AUDIO_LOCALFILE);
    m_fileSize = audiofile.size(); // TEST loop

    char *afn = NULL; // audioFileName
    afn = strdup(audiofile.name());

    uint8_t dotPos = lastIndexOf(afn, ".");
    for (uint8_t i = dotPos + 1; i < strlen(afn); i++) {
        afn[i] = toLowerCase(afn[i]);
    }

    if (endsWith(afn, ".mp3"))
        m_codec = CODEC_MP3; // m_codec is by default CODEC_NONE
    if (endsWith(afn, ".m4a"))
        m_codec = CODEC_M4A;
    if (endsWith(afn, ".aac"))
        m_codec = CODEC_AAC;
    if (endsWith(afn, ".wav"))
        m_codec = CODEC_WAV;
    if (endsWith(afn, ".flac"))
        m_codec = CODEC_FLAC;
    if (endsWith(afn, ".opus"))
        m_codec = CODEC_OPUS;
    if (endsWith(afn, ".ogg"))
        m_codec = CODEC_OGG;
    if (endsWith(afn, ".oga"))
        m_codec = CODEC_OGG;

    if (m_codec == CODEC_NONE)
        AUDIO_INFO("The %s format is not supported", afn + dotPos);

    if (afn) {
        free(afn);
        afn = NULL;
    }
    free(audioPath);

    bool ret = initializeDecoder();
    if (ret)
        m_f_running = true;
    else
        audiofile.close();
    xSemaphoreGiveRecursive(mutex_audio);
    return ret;
}
//---------------------------------------------------------------------------------------------------------------------
#if 1
bool AudioHelpr::connecttospeech(const char *speech, const char *lang)
{

    xSemaphoreTakeRecursive(mutex_audio, portMAX_DELAY);

    setDefaults();
    char host[] = "tsn.baidu.com";
    char path[] = "/text2audio";
    String headers = "Content-Type: application/x-www-form-urlencoded\r\nAccept: */*";

    // API_KEY = "MYzsCF2FKO9rNK4qXh4HyMCA";
    // SECRET_KEY = "8CmQ0egq6jiyKGdzXvPr3dZf7hpFRlmK";
    uint16_t speechLen = strlen(speech);
    uint16_t speechBuffLen = speechLen + 600;
    char *speechBuff = (char *)malloc(speechBuffLen);
    if (!speechBuff) {
        log_e("out of memory");
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }
    memcpy(speechBuff, speech, speechLen);
    speechBuff[speechLen] = '\0';
    urlencode(speechBuff, speechBuffLen);
    // ctp = 1 &lan = zh &spd = 5 &pit = 5 &vol = 5 &per = 1 &aue = 3 ";

    char perid_str[2];
    sprintf(perid_str, "%d", m_perid);

    char resp[strlen(speechBuff) + 200] = "";
    strcat(resp, "tex=");
    strcat(resp, speechBuff);
    strcat(resp, "&tok=24.75ea20bda8efbf7601cb62eab8ce6924.2592000.1726856129.282335-109052759&");
    strcat(resp, "cuid=aAzA4gBN5mmIViCqofGDaMUseHsVs4AS&");
    strcat(resp, "ctp=1&");
    strcat(resp, "lan=zh&");
    strcat(resp, "spd=7&");
    strcat(resp, "pit=5&");
    strcat(resp, "vol=15&");
    // 发音人 基础 精选需要开通免费领取额度
    strcat(resp, "per=");
    strcat(resp, perid_str);
    strcat(resp, "&aue=3");

    if (speechBuff) {
        free(speechBuff);
        speechBuff = NULL;
    }
    _client = static_cast<WiFiClient *>(&client);
    if (!_client->connect(host, 80)) {
        log_e("Connection failed");
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }
    _client->print("POST ");
    _client->print(path);
    _client->println(" HTTP/1.1");
    _client->print("Host: ");
    _client->println(host);
    _client->println(headers);
    _client->print("Content-Length: ");
    _client->println(strlen(resp));
    _client->println(); // 空行，表示头部结束

    // 发送请求的实体内容（payload）
    _client->print(resp);
    // _client->print(resp);
    // Serial.println(resp);
    m_streamType = ST_WEBFILE;
    isplaying = 1;
    m_f_running = true;
    m_f_ssl = false;
    m_f_tts = true;
    setDatamode(HTTP_RESPONSE_HEADER);
    xSemaphoreGiveRecursive(mutex_audio);
    return true;
}

#else

bool AudioHelpr::connecttospeech(const char *speech, const char *lang)
{
    xSemaphoreTakeRecursive(mutex_audio, portMAX_DELAY);

    setDefaults();
    char host[] = "api.minimax.chat";
    char path[] = "/v1/t2a_pro?GroupId=1793262119999783852";
    String headers = "Content-Type: application/json,Authorization:Bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJHcm91cE5hbWUiOiLpmYjlhYnlro8iLCJVc2VyTmFtZSI6IumZiOWFieWujyIsIkFjY291bnQiOiIiLCJTdWJqZWN0SUQiOiIxNzkzMjYyMTIwMDA4MTcyNDYwIiwiUGhvbmUiOiIxODkyNjI0NzExMiIsIkdyb3VwSUQiOiIxNzkzMjYyMTE5OTk5NzgzODUyIiwiUGFnZU5hbWUiOiIiLCJNYWlsIjoiIiwiQ3JlYXRlVGltZSI6IjIwMjQtMDYtMjIgMTU6NDc6MTYiLCJpc3MiOiJtaW5pbWF4In0.XCozhyQkIr1r-_JXamid9sOa4A83v9dTcsyHj5COIi1bCgrzD4ANb-ZpNBIRs_qmvx5mUobo9Q3u890JzDllimit15QiXhDVv8kV71jJcoW-i0CfXC2N5HagOVgIGpKi3CZ12X1c3szjcSjjFAseq1djFuzRp6lCwxtVrqCSJz8Nwx2FO_Q0ZdWKxso73i6MfgfJAkfLHqc87SFwZXmvun08JVZrgwlDOF3QqvXce002Tpa6h9d6y1dG_cs-hXS4Br31h-3W7g_JAfywOz5yVSLaXi5ghnRRHqTXohSSzhuA9ZcS4h0LDI81425GVbTmKwapu9Op26YV69hK6IPyFg";

    // API_KEY = "MYzsCF2FKO9rNK4qXh4HyMCA";
    // SECRET_KEY = "8CmQ0egq6jiyKGdzXvPr3dZf7hpFRlmK";
    uint16_t speechLen = strlen(speech);
    uint16_t speechBuffLen = speechLen + 600;
    char *speechBuff = (char *)malloc(speechBuffLen);
    if (!speechBuff) {
        log_e("out of memory");
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }
    memcpy(speechBuff, speech, speechLen);
    speechBuff[speechLen] = '\0';
    urlencode(speechBuff, speechBuffLen);
    // ctp = 1 &lan = zh &spd = 5 &pit = 5 &vol = 5 &per = 1 &aue = 3 ";

    char resp[strlen(speechBuff) + 200] = "";
    strcat(resp, "text=");
    strcat(resp, speechBuff);
    strcat(resp, "model=speech-01&");
    strcat(resp, "audio_sample_rate=32000&");
    strcat(resp, "bitrate=128000&");
    strcat(resp, "voice_id=female-tianmei-jingpin");

    if (speechBuff) {
        free(speechBuff);
        speechBuff = NULL;
    }
    _client = static_cast<WiFiClient *>(&client);
    if (!_client->connect(host, 80)) {
        log_e("Connection failed");
        xSemaphoreGiveRecursive(mutex_audio);
        return false;
    }
    _client->print("POST ");
    _client->print(path);
    _client->println(" HTTP/1.1");
    _client->print("Host: ");
    _client->println(host);
    _client->println(headers);
    _client->print("Content-Length: ");
    _client->println(strlen(resp));
    _client->println(); // 空行，表示头部结束

    // 发送请求的实体内容（payload）
    _client->print(resp);
    // _client->print(resp);
    Serial.println(resp);
    m_streamType = ST_WEBFILE;
    isplaying = 1;
    m_f_running = true;
    m_f_ssl = false;
    m_f_tts = true;
    setDatamode(HTTP_RESPONSE_HEADER);
    xSemaphoreGiveRecursive(mutex_audio);
    return true;
}

#endif

