1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::urlencode(char *buff, uint16_t buffLen, bool spacesOnly)
{

    uint16_t len = strlen(buff);
    uint8_t *tmpbuff = (uint8_t *)malloc(buffLen);
    if (!tmpbuff) {
        log_e("out of memory");
        return;
    }
    char c;
    char code0;
    char code1;
    uint16_t j = 0;
    for (int i = 0; i < len; i++) {
        c = buff[i];
        if (isalnum(c))
            tmpbuff[j++] = c;
        else if (spacesOnly) {
            if (c == ' ') {
                tmpbuff[j++] = '%';
                tmpbuff[j++] = '2';
                tmpbuff[j++] = '0';
            } else {
                tmpbuff[j++] = c;
            }
        } else {
            code1 = (c & 0xf) + '0';
            if ((c & 0xf) > 9)
                code1 = (c & 0xf) - 10 + 'A';
            c = (c >> 4) & 0xf;
            code0 = c + '0';
            if (c > 9)
                code0 = c - 10 + 'A';
            tmpbuff[j++] = '%';
            tmpbuff[j++] = code0;
            tmpbuff[j++] = code1;
        }
        if (j == buffLen - 1) {
            log_e("out of memory");
            break;
        }
    }
    memcpy(buff, tmpbuff, j);
    buff[j] = '\0';
    free(tmpbuff);
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::showID3Tag(const char *tag, const char *value)
{

    m_chbuf[0] = 0;
    // V2.2
    if (!strcmp(tag, "CNT"))
        sprintf(m_chbuf, "Play counter: %s", value);
    // if(!strcmp(tag, "COM")) sprintf(m_chbuf, "Comments: %s", value);
    if (!strcmp(tag, "CRA"))
        sprintf(m_chbuf, "Audio encryption: %s", value);
    if (!strcmp(tag, "CRM"))
        sprintf(m_chbuf, "Encrypted meta frame: %s", value);
    if (!strcmp(tag, "ETC"))
        sprintf(m_chbuf, "Event timing codes: %s", value);
    if (!strcmp(tag, "EQU"))
        sprintf(m_chbuf, "Equalization: %s", value);
    if (!strcmp(tag, "IPL"))
        sprintf(m_chbuf, "Involved people list: %s", value);
    if (!strcmp(tag, "PIC"))
        sprintf(m_chbuf, "Attached picture: %s", value);
    if (!strcmp(tag, "SLT"))
        sprintf(m_chbuf, "Synchronized lyric/text: %s", value);
    if (!strcmp(tag, "TAL"))
        sprintf(m_chbuf, "Album/Movie/Show title: %s", value);
    if (!strcmp(tag, "TBP"))
        sprintf(m_chbuf, "BPM (Beats Per Minute): %s", value);
    if (!strcmp(tag, "TCM"))
        sprintf(m_chbuf, "Composer: %s", value);
    if (!strcmp(tag, "TCO"))
        sprintf(m_chbuf, "Content type: %s", value);
    if (!strcmp(tag, "TCR"))
        sprintf(m_chbuf, "Copyright message: %s", value);
    if (!strcmp(tag, "TDA"))
        sprintf(m_chbuf, "Date: %s", value);
    if (!strcmp(tag, "TDY"))
        sprintf(m_chbuf, "Playlist delay: %s", value);
    if (!strcmp(tag, "TEN"))
        sprintf(m_chbuf, "Encoded by: %s", value);
    if (!strcmp(tag, "TFT"))
        sprintf(m_chbuf, "File type: %s", value);
    if (!strcmp(tag, "TIM"))
        sprintf(m_chbuf, "Time: %s", value);
    if (!strcmp(tag, "TKE"))
        sprintf(m_chbuf, "Initial key: %s", value);
    if (!strcmp(tag, "TLA"))
        sprintf(m_chbuf, "Language(s): %s", value);
    if (!strcmp(tag, "TLE"))
        sprintf(m_chbuf, "Length: %s", value);
    if (!strcmp(tag, "TMT"))
        sprintf(m_chbuf, "Media type: %s", value);
    if (!strcmp(tag, "TOA"))
        sprintf(m_chbuf, "Original artist(s)/performer(s): %s", value);
    if (!strcmp(tag, "TOF"))
        sprintf(m_chbuf, "Original filename: %s", value);
    if (!strcmp(tag, "TOL"))
        sprintf(m_chbuf, "Original Lyricist(s)/text writer(s): %s", value);
    if (!strcmp(tag, "TOR"))
        sprintf(m_chbuf, "Original release year: %s", value);
    if (!strcmp(tag, "TOT"))
        sprintf(m_chbuf, "Original album/Movie/Show title: %s", value);
    if (!strcmp(tag, "TP1"))
        sprintf(m_chbuf, "Lead artist(s)/Lead performer(s)/Soloist(s)/Performing group: %s", value);
    if (!strcmp(tag, "TP2"))
        sprintf(m_chbuf, "Band/Orchestra/Accompaniment: %s", value);
    if (!strcmp(tag, "TP3"))
        sprintf(m_chbuf, "Conductor/Performer refinement: %s", value);
    if (!strcmp(tag, "TP4"))
        sprintf(m_chbuf, "Interpreted, remixed, or otherwise modified by: %s", value);
    if (!strcmp(tag, "TPA"))
        sprintf(m_chbuf, "Part of a set: %s", value);
    if (!strcmp(tag, "TPB"))
        sprintf(m_chbuf, "Publisher: %s", value);
    if (!strcmp(tag, "TRC"))
        sprintf(m_chbuf, "ISRC (International Standard Recording Code): %s", value);
    if (!strcmp(tag, "TRD"))
        sprintf(m_chbuf, "Recording dates: %s", value);
    if (!strcmp(tag, "TRK"))
        sprintf(m_chbuf, "Track number/Position in set: %s", value);
    if (!strcmp(tag, "TSI"))
        sprintf(m_chbuf, "Size: %s", value);
    if (!strcmp(tag, "TSS"))
        sprintf(m_chbuf, "Software/hardware and settings used for encoding: %s", value);
    if (!strcmp(tag, "TT1"))
        sprintf(m_chbuf, "Content group description: %s", value);
    if (!strcmp(tag, "TT2"))
        sprintf(m_chbuf, "Title/Songname/Content description: %s", value);
    if (!strcmp(tag, "TT3"))
        sprintf(m_chbuf, "Subtitle/Description refinement: %s", value);
    if (!strcmp(tag, "TXT"))
        sprintf(m_chbuf, "Lyricist/text writer: %s", value);
    if (!strcmp(tag, "TXX"))
        sprintf(m_chbuf, "User defined text information frame: %s", value);
    if (!strcmp(tag, "TYE"))
        sprintf(m_chbuf, "Year: %s", value);
    if (!strcmp(tag, "UFI"))
        sprintf(m_chbuf, "Unique file identifier: %s", value);
    if (!strcmp(tag, "ULT"))
        sprintf(m_chbuf, "Unsychronized lyric/text transcription: %s", value);
    if (!strcmp(tag, "WAF"))
        sprintf(m_chbuf, "Official audio file webpage: %s", value);
    if (!strcmp(tag, "WAR"))
        sprintf(m_chbuf, "Official artist/performer webpage: %s", value);
    if (!strcmp(tag, "WAS"))
        sprintf(m_chbuf, "Official audio source webpage: %s", value);
    if (!strcmp(tag, "WCM"))
        sprintf(m_chbuf, "Commercial information: %s", value);
    if (!strcmp(tag, "WCP"))
        sprintf(m_chbuf, "Copyright/Legal information: %s", value);
    if (!strcmp(tag, "WPB"))
        sprintf(m_chbuf, "Publishers official webpage: %s", value);
    if (!strcmp(tag, "WXX"))
        sprintf(m_chbuf, "User defined URL link frame: %s", value);

    // V2.3 V2.4 tags
    // if(!strcmp(tag, "COMM")) sprintf(m_chbuf, "Comment: %s", value);
    if (!strcmp(tag, "OWNE"))
        sprintf(m_chbuf, "Ownership: %s", value);
    // if(!strcmp(tag, "PRIV")) sprintf(m_chbuf, "Private: %s", value);
    if (!strcmp(tag, "SYLT"))
        sprintf(m_chbuf, "SynLyrics: %s", value);
    if (!strcmp(tag, "TALB"))
        sprintf(m_chbuf, "Album: %s", value);
    if (!strcmp(tag, "TBPM"))
        sprintf(m_chbuf, "BeatsPerMinute: %s", value);
    if (!strcmp(tag, "TCMP"))
        sprintf(m_chbuf, "Compilation: %s", value);
    if (!strcmp(tag, "TCOM"))
        sprintf(m_chbuf, "Composer: %s", value);
    if (!strcmp(tag, "TCON"))
        sprintf(m_chbuf, "ContentType: %s", value);
    if (!strcmp(tag, "TCOP"))
        sprintf(m_chbuf, "Copyright: %s", value);
    if (!strcmp(tag, "TDAT"))
        sprintf(m_chbuf, "Date: %s", value);
    if (!strcmp(tag, "TEXT"))
        sprintf(m_chbuf, "Lyricist: %s", value);
    if (!strcmp(tag, "TIME"))
        sprintf(m_chbuf, "Time: %s", value);
    if (!strcmp(tag, "TIT1"))
        sprintf(m_chbuf, "Grouping: %s", value);
    if (!strcmp(tag, "TIT2"))
        sprintf(m_chbuf, "Title: %s", value);
    if (!strcmp(tag, "TIT3"))
        sprintf(m_chbuf, "Subtitle: %s", value);
    if (!strcmp(tag, "TLAN"))
        sprintf(m_chbuf, "Language: %s", value);
    if (!strcmp(tag, "TLEN"))
        sprintf(m_chbuf, "Length (ms): %s", value);
    if (!strcmp(tag, "TMED"))
        sprintf(m_chbuf, "Media: %s", value);
    if (!strcmp(tag, "TOAL"))
        sprintf(m_chbuf, "OriginalAlbum: %s", value);
    if (!strcmp(tag, "TOPE"))
        sprintf(m_chbuf, "OriginalArtist: %s", value);
    if (!strcmp(tag, "TORY"))
        sprintf(m_chbuf, "OriginalReleaseYear: %s", value);
    if (!strcmp(tag, "TPE1"))
        sprintf(m_chbuf, "Artist: %s", value);
    if (!strcmp(tag, "TPE2"))
        sprintf(m_chbuf, "Band: %s", value);
    if (!strcmp(tag, "TPE3"))
        sprintf(m_chbuf, "Conductor: %s", value);
    if (!strcmp(tag, "TPE4"))
        sprintf(m_chbuf, "InterpretedBy: %s", value);
    if (!strcmp(tag, "TPOS"))
        sprintf(m_chbuf, "PartOfSet: %s", value);
    if (!strcmp(tag, "TPUB"))
        sprintf(m_chbuf, "Publisher: %s", value);
    if (!strcmp(tag, "TRCK"))
        sprintf(m_chbuf, "Track: %s", value);
    if (!strcmp(tag, "TSSE"))
        sprintf(m_chbuf, "SettingsForEncoding: %s", value);
    if (!strcmp(tag, "TRDA"))
        sprintf(m_chbuf, "RecordingDates: %s", value);
    if (!m_f_m3u8data)
        if (!strcmp(tag, "TXXX"))
            sprintf(m_chbuf, "UserDefinedText: %s", value);
    if (!strcmp(tag, "TYER"))
        sprintf(m_chbuf, "Year: %s", value);
    if (!strcmp(tag, "USER"))
        sprintf(m_chbuf, "TermsOfUse: %s", value);
    if (!strcmp(tag, "USLT"))
        sprintf(m_chbuf, "Lyrics: %s", value);
    if (!strcmp(tag, "WOAR"))
        sprintf(m_chbuf, "OfficialArtistWebpage: %s", value);
    if (!strcmp(tag, "XDOR"))
        sprintf(m_chbuf, "OriginalReleaseTime: %s", value);

    latinToUTF8(m_chbuf, sizeof(m_chbuf));
    if (m_chbuf[0] != 0)
        if (audio_id3data)
            audio_id3data(m_chbuf);
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::unicode2utf8(char *buff, uint32_t len)
{
    // converts unicode in UTF-8, buff contains the string to be converted up to len
    // range U+1 ... U+FFFF
    uint8_t *tmpbuff = (uint8_t *)malloc(len * 2);
    if (!tmpbuff) {
        log_e("out of memory");
        return;
    }
    bool bitorder = false;
    uint16_t j = 0;
    uint16_t k = 0;
    uint16_t m = 0;
    uint8_t uni_h = 0;
    uint8_t uni_l = 0;

