1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
        if (startsWith(tag, "APIC")) { // a image embedded in file, passing it to external function
            isUnicode = false;
            if (getDatamode() == AUDIO_LOCALFILE) {
                APIC_seen = true;
                APIC_pos = id3Size - remainingHeaderBytes;
                APIC_size = framesize;
            }
            return 0;
        }

        if ( // any lyrics embedded in file, passing it to external function
            startsWith(tag, "SYLT") || startsWith(tag, "TXXX") || startsWith(tag, "USLT")) {
            if (getDatamode() == AUDIO_LOCALFILE) {
                SYLT_seen = true;
                SYLT_pos = id3Size - remainingHeaderBytes;
                SYLT_size = framesize;
            }
            return 0;
        }

        size_t fs = framesize;
        if (fs > 512)
            fs = 512;
        for (int i = 0; i < fs; i++) {
            m_ibuff[i] = *(data + i);
        }
        framesize -= fs;
        remainingHeaderBytes -= fs;
        m_ibuff[fs] = 0;

        if (isUnicode && fs > 1) {
            unicode2utf8(m_ibuff, fs); // convert unicode to utf-8 U+0020...U+07FF
        }

        if (!isUnicode) {
            uint16_t j = 0, k = 0;
            j = 0;
            k = 0;
            while (j < fs) {
                if (m_ibuff[j] == 0x0A)
                    m_ibuff[j] = 0x20; // replace LF by space
                if (m_ibuff[j] > 0x1F) {
                    m_ibuff[k] = m_ibuff[j];
                    k++;
                }
                j++;
            } // remove non printables
            if (k > 0)
                m_ibuff[k] = 0;
            else
                m_ibuff[0] = 0; // new termination
        }
        showID3Tag(tag, m_ibuff);
        return fs;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    // --- section V2.2 only , greater Vers above ----
    // see https://mutagen-specs.readthedocs.io/en/latest/id3/id3v2.2.html
    if (m_controlCounter == 10) { // frames in V2.2, 3bytes identifier, 3bytes size descriptor

        if (universal_tmp > 0) {
            if (universal_tmp > 256) {
                universal_tmp -= 256;
                return 256;
            } else {
                uint8_t t = universal_tmp;
                universal_tmp = 0;
                return t;
            }
        }

        frameid[0] = *(data + 0);
        frameid[1] = *(data + 1);
        frameid[2] = *(data + 2);
        frameid[3] = 0;
        for (uint8_t i = 0; i < 4; i++)
            tag[i] = frameid[i]; // tag = frameid
        remainingHeaderBytes -= 3;
        size_t len = bigEndian(data + 3, 3);
        universal_tmp = len;
        remainingHeaderBytes -= 3;
        char value[256];
        if (len > 249) {
            len = 249;
        }
        memcpy(value, (data + 7), len);
        value[len + 1] = 0;
        m_chbuf[0] = 0;
        if (startsWith(tag, "PIC")) { // image embedded in header
            if (getDatamode() == AUDIO_LOCALFILE) {
                APIC_seen = true; // #460
                APIC_pos = id3Size - remainingHeaderBytes;
                APIC_size = universal_tmp;
                if (m_f_Log)
                    log_i("Attached picture seen at pos %d length %d", APIC_pos, APIC_size);
            }
        } else if (startsWith(tag, "SLT")) { // lyrics embedded in header
            if (getDatamode() == AUDIO_LOCALFILE) {
                SYLT_seen = true; // #460
                SYLT_pos = id3Size - remainingHeaderBytes;
                SYLT_size = universal_tmp;
                if (m_f_Log)
                    log_i("Attached lyrics seen at pos %d length %d", SYLT_pos, SYLT_size);
            }
        } else {
            showID3Tag(tag, value);
        }
        remainingHeaderBytes -= universal_tmp;
        universal_tmp -= len;

        if (len == 0)
            m_controlCounter = 98;
        if (remainingHeaderBytes == 0)
            m_controlCounter = 98;

        return 3 + 3 + len;
    }
    // -- end section V2.2 -----------

    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == 98) { // skip all ID3 metadata (mostly spaces)
        if (remainingHeaderBytes > 256) {
            remainingHeaderBytes -= 256;
            return 256;
        } // Throw it away
        else {
            m_controlCounter = 99;
            return remainingHeaderBytes;
        } // Throw it away
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == 99) { //  exist another ID3tag?
        m_audioDataStart += id3Size;
        vTaskDelay(30);
        if ((*(data + 0) == 'I') && (*(data + 1) == 'D') && (*(data + 2) == '3')) {
            m_controlCounter = 0;
            return 0;
        } else {
            m_controlCounter = 100; // ok
            m_audioDataSize = m_contentlength - m_audioDataStart;
            if (!m_f_m3u8data)
                AUDIO_INFO("Audio-Length: %u", m_audioDataSize);
            if (APIC_seen && audio_id3image) {
                size_t pos = audiofile.position();
                audio_id3image(audiofile, APIC_pos, APIC_size);
                audiofile.seek(pos); // the filepointer could have been changed by the user, set it back
            }
            if (SYLT_seen && audio_id3lyrics) {
                size_t pos = audiofile.position();
                audio_id3lyrics(audiofile, SYLT_pos, SYLT_size);
                audiofile.seek(pos); // the filepointer could have been changed by the user, set it back
            }
            return 0;
        }
    }
    return 0;
}
//---------------------------------------------------------------------------------------------------------------------
int AudioHelpr::read_M4A_Header(uint8_t *data, size_t len)
{
    /*
           ftyp
             | - moov  -> trak -> ... -> mp4a contains raw block parameters
             |    L... -> ilst  contains artist, composer ....
           free (optional) // jump to another atoms at the end of mdat
             |
           mdat contains the audio data                                                      */

