1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    static size_t headerSize = 0;
    static size_t retvalue = 0;
    static size_t atomsize = 0;
    static size_t audioDataPos = 0;

    if (m_controlCounter == M4A_BEGIN)
        retvalue = 0;
    static size_t cnt = 0;
    if (retvalue) {
        if (len > InBuff.getMaxBlockSize())
            len = InBuff.getMaxBlockSize();
        if (retvalue > len) { // if returnvalue > bufferfillsize
            retvalue -= len;  // and wait for more bufferdata
            cnt += len;
            return len;
        } else {
            size_t tmp = retvalue;
            retvalue = 0;
            cnt += tmp;
            cnt = 0;
            return tmp;
        }
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_BEGIN) { // init
        headerSize = 0;
        retvalue = 0;
        atomsize = 0;
        audioDataPos = 0;
        m_controlCounter = M4A_FTYP;
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_FTYP) { /* check_m4a_file */
        atomsize = bigEndian(data, 4);  // length of first atom
        if (specialIndexOf(data, "ftyp", 10) != 4) {
            log_e("atom 'ftyp' not found in header");
            stopSong();
            return -1;
        }
        int m4a = specialIndexOf(data, "M4A ", 20);
        int isom = specialIndexOf(data, "isom", 20);
        int mp42 = specialIndexOf(data, "mp42", 20);

        if ((m4a != 8) && (isom != 8) && (mp42 != 8)) {
            log_e("subtype 'MA4 ', 'isom' or 'mp42' expected, but found '%s '", (data + 8));
            stopSong();
            return -1;
        }

        m_controlCounter = M4A_CHK;
        retvalue = atomsize;
        headerSize = atomsize;
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_CHK) { /* check  Tag */
        atomsize = bigEndian(data, 4); // length of this atom
        if (specialIndexOf(data, "moov", 10) == 4) {
            m_controlCounter = M4A_MOOV;
            return 0;
        } else if (specialIndexOf(data, "free", 10) == 4) {
            retvalue = atomsize;
            headerSize += atomsize;
            return 0;
        } else if (specialIndexOf(data, "mdat", 10) == 4) {
            m_controlCounter = M4A_MDAT;
            return 0;
        } else {
            char atomName[5] = {0};
            (void)atomName;
            atomName[0] = *data;
            atomName[1] = *(data + 1);
            atomName[2] = *(data + 2);
            atomName[3] = *(data + 3);
            atomName[4] = 0;

            if (m_f_Log)
                log_i("atom %s found", atomName);

            retvalue = atomsize;
            headerSize += atomsize;
            return 0;
        }
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_MOOV) { // moov
        // we are looking for track and ilst
        if (specialIndexOf(data, "trak", len) > 0) {
            int offset = specialIndexOf(data, "trak", len);
            retvalue = offset;
            atomsize -= offset;
            headerSize += offset;
            m_controlCounter = M4A_TRAK;
            return 0;
        }
        if (specialIndexOf(data, "ilst", len) > 0) {
            int offset = specialIndexOf(data, "ilst", len);
            retvalue = offset;
            atomsize -= offset;
            headerSize += offset;
            m_controlCounter = M4A_ILST;
            return 0;
        }
        m_controlCounter = M4A_CHK;
        headerSize += atomsize;
        retvalue = atomsize;
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_TRAK) { // trak
        if (specialIndexOf(data, "esds", len) > 0) {
            int esds = specialIndexOf(data, "esds", len); // Packaging/Encapsulation And Setup Data
            uint8_t *pos = data + esds;
            uint8_t len_of_OD = *(pos + 12); // length of this OD (which includes the next 2 tags)
            (void)len_of_OD;
            uint8_t len_of_ESD = *(pos + 20); // length of this Elementary Stream Descriptor
            (void)len_of_ESD;
            uint8_t audioType = *(pos + 21);

            if (audioType == 0x40) {
                AUDIO_INFO("AudioType: MPEG4 / Audio");
            } // ObjectTypeIndication
            else if (audioType == 0x66) {
                AUDIO_INFO("AudioType: MPEG2 / Audio");
            } else if (audioType == 0x69) {
                AUDIO_INFO("AudioType: MPEG2 / Audio Part 3");
            } // Backward Compatible Audio
            else if (audioType == 0x6B) {
                AUDIO_INFO("AudioType: MPEG1 / Audio");
            } else {
                AUDIO_INFO("unknown Audio Type %x", audioType);
            }

            uint8_t streamType = *(pos + 22);
            streamType = streamType >> 2; // 6 bits
            if (streamType != 5) {
                log_e("Streamtype is not audio!");
            }

            uint32_t maxBr = bigEndian(pos + 26, 4); // max bitrate
            AUDIO_INFO("max bitrate: %i", maxBr);

            uint32_t avrBr = bigEndian(pos + 30, 4); // avg bitrate
            AUDIO_INFO("avr bitrate: %i", avrBr);

            uint16_t ASC = bigEndian(pos + 39, 2);

            uint8_t objectType = ASC >> 11; // first 5 bits

            if (objectType == 1) {
                AUDIO_INFO("AudioObjectType: AAC Main");
            } // Audio Object Types
            else if (objectType == 2) {
                AUDIO_INFO("AudioObjectType: AAC Low Complexity");
            } else if (objectType == 3) {
                AUDIO_INFO("AudioObjectType: AAC Scalable Sample Rate");
            } else if (objectType == 4) {
                AUDIO_INFO("AudioObjectType: AAC Long Term Prediction");
            } else if (objectType == 5) {
                AUDIO_INFO("AudioObjectType: AAC Spectral Band Replication");
            } else if (objectType == 6) {
                AUDIO_INFO("AudioObjectType: AAC Scalable");
            } else {
                AUDIO_INFO("unknown Audio Type %x", audioType);
            }

            const uint32_t samplingFrequencies[13] = {
                96000, 88200, 64000, 48000, 44100, 32000, 24000, 22050, 16000, 12000, 11025, 8000, 7350};
            uint8_t sRate = (ASC & 0x0600) >> 7; // next 4 bits Sampling Frequencies
            AUDIO_INFO("Sampling Frequency: %u", samplingFrequencies[sRate]);

            uint8_t chConfig = (ASC & 0x78) >> 3; // next 4 bits
            if (chConfig == 0)
                AUDIO_INFO("Channel Configurations: AOT Specifc Config");
            if (chConfig == 1)
                AUDIO_INFO("Channel Configurations: front-center");
            if (chConfig == 2)
                AUDIO_INFO("Channel Configurations: front-left, front-right");
            if (chConfig > 2) {
                log_e("Channel Configurations with more than 2 channels is not allowed!");
            }

            uint8_t frameLengthFlag = (ASC & 0x04);
            uint8_t dependsOnCoreCoder = (ASC & 0x02);
            (void)dependsOnCoreCoder;
            uint8_t extensionFlag = (ASC & 0x01);
            (void)extensionFlag;

            if (frameLengthFlag == 0)
                AUDIO_INFO("AAC FrameLength: 1024 bytes");
            if (frameLengthFlag == 1)
                AUDIO_INFO("AAC FrameLength: 960 bytes");
        }
        if (specialIndexOf(data, "mp4a", len) > 0) {
            int offset = specialIndexOf(data, "mp4a", len);
            int channel = bigEndian(data + offset + 20, 2); // audio parameter must be set before starting
            int bps = bigEndian(data + offset + 22, 2);     // the aac decoder. There are RAW blocks only in m4a
            int srate = bigEndian(data + offset + 26, 4);   //
            setBitsPerSample(bps);
            setChannels(channel);
            setSampleRate(srate);
            setBitrate(bps * channel * srate);
            AUDIO_INFO("ch; %i, bps: %i, sr: %i", channel, bps, srate);
            if (audioDataPos && getDatamode() == AUDIO_LOCALFILE) {
                m_controlCounter = M4A_AMRDY;
                setFilePos(audioDataPos);
                return 0;
            }
        }
        m_controlCounter = M4A_MOOV;
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_ILST) { // ilst
        const char info[12][6] = {"nam\0", "ART\0", "alb\0", "too\0", "cmt\0", "wrt\0",
                                  "tmpo\0", "trkn\0", "day\0", "cpil\0", "aART\0", "gen\0"};
        int offset = 0;
        // If it's a local file, the metadata has already been read, even if it comes after the audio block.
        // In the event that they are in front of the audio block in a web stream, read them now
        if (!m_f_m4aID3dataAreRead) {
            for (int i = 0; i < 12; i++) {
                offset = specialIndexOf(data, info[i], len, true); // seek info[] with '\0'
                if (offset > 0) {
                    offset += 19;
                    if (*(data + offset) == 0)
                        offset++;
                    char value[256] = {0};
                    size_t tmp = strlen((const char *)data + offset);
                    if (tmp > 254)
                        tmp = 254;
                    memcpy(value, (data + offset), tmp);
                    value[tmp] = '\0';
                    m_chbuf[0] = '\0';
                    if (i == 0)
                        sprintf(m_chbuf, "Title: %s", value);
                    if (i == 1)
                        sprintf(m_chbuf, "Artist: %s", value);
                    if (i == 2)
                        sprintf(m_chbuf, "Album: %s", value);
                    if (i == 3)
                        sprintf(m_chbuf, "Encoder: %s", value);
                    if (i == 4)
                        sprintf(m_chbuf, "Comment: %s", value);
                    if (i == 5)
                        sprintf(m_chbuf, "Composer: %s", value);
                    if (i == 6)
                        sprintf(m_chbuf, "BPM: %s", value);
                    if (i == 7)
                        sprintf(m_chbuf, "Track Number: %s", value);
                    if (i == 8)
                        sprintf(m_chbuf, "Year: %s", value);
                    if (i == 9)
                        sprintf(m_chbuf, "Compile: %s", value);
                    if (i == 10)
                        sprintf(m_chbuf, "Album Artist: %s", value);
                    if (i == 11)
                        sprintf(m_chbuf, "Types of: %s", value);
                    if (m_chbuf[0] != 0) {
                        if (audio_id3data)
                            audio_id3data(m_chbuf);
                    }
                }
            }
        }
        m_controlCounter = M4A_MOOV;
        return 0;
    }
    // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter == M4A_MDAT) {           // mdat
        m_audioDataSize = bigEndian(data, 4) - 8; // length of this atom - strlen(M4A_MDAT)
        AUDIO_INFO("Audio-Length: %u", m_audioDataSize);
        retvalue = 8;
        headerSize += 8;
        m_controlCounter = M4A_AMRDY; // last step before starting the audio
        return 0;
    }

    if (m_controlCounter == M4A_AMRDY) { // almost ready
        m_audioDataStart = headerSize;
        //        m_contentlength = headerSize + m_audioDataSize; // after this mdat atom there may be other atoms
        if (getDatamode() == AUDIO_LOCALFILE) {
            AUDIO_INFO("Content-Length: %u", m_contentlength);
        }
        m_controlCounter = M4A_OKAY; // that's all
        return 0;
    }
    // this section should never be reached
    log_e("error");
    return 0;
}
//---------------------------------------------------------------------------------------------------------------------
size_t AudioHelpr::process_m3u8_ID3_Header(uint8_t *packet)
{
    uint8_t ID3version;
    size_t id3Size;
    bool m_f_unsync = false, m_f_exthdr = false;
    uint64_t current_timestamp = 0;

    (void)m_f_unsync;        // suppress -Wunused-variable
    (void)current_timestamp; // suppress -Wunused-variable

