1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (specialIndexOf(packet, "ID3", 4) != 0) { // ID3 not found
        if (m_f_Log)
            log_i("m3u8 file has no mp3 tag");
        return 0; // error, no ID3 signature found
    }
    ID3version = *(packet + 3);
    switch (ID3version) {
    case 2:
        m_f_unsync = (*(packet + 5) & 0x80);
        m_f_exthdr = false;
        break;
    case 3:
    case 4:
        m_f_unsync = (*(packet + 5) & 0x80); // bit7
        m_f_exthdr = (*(packet + 5) & 0x40); // bit6 extended header
        break;
    };
    id3Size = bigEndian(&packet[6], 4, 7); //  ID3v2 size  4 * %0xxxxxxx (shift left seven times!!)
    id3Size += 10;
    if (m_f_Log)
        log_i("ID3 framesSize: %i", id3Size);
    if (m_f_Log)
        log_i("ID3 version: 2.%i", ID3version);

    if (m_f_exthdr) {
        log_e("ID3 extended header in m3u8 files not supported");
        return 0;
    }
    if (m_f_Log)
        log_i("ID3 normal frames");

    if (specialIndexOf(&packet[10], "PRIV", 5) != 0) { // tag PRIV not found
        log_e("tag PRIV in m3u8 Id3 Header not found");
        return 0;
    }
    // if tag PRIV exists assume content is "com.apple.streaming.transportStreamTimestamp"
    // a time stamp is expected in the header.

    current_timestamp = (double)bigEndian(&packet[69], 4) / 90000; // seconds

    return id3Size;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::stopSong()
{
    uint32_t pos = 0;
    if (m_f_running) {
        m_f_running = false;
        if (getDatamode() == AUDIO_LOCALFILE) {
            m_streamType = ST_NONE;
            pos = getFilePos() - inBufferFilled();
            audiofile.close();
            AUDIO_INFO("Closing audio file");
        }
    }
    if (audiofile) {
        // added this before putting 'm_f_localfile = false' in stopSong(); shoulf never occur....
        audiofile.close();
        AUDIO_INFO("Closing audio file");
        log_w("Closing audio file"); // for debug
    }
    memset(m_outBuff, 0, 2048 * 2 * sizeof(uint16_t)); // Clear OutputBuffer
    i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);
    return pos;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::pauseResume()
{
    xSemaphoreTake(mutex_audio, portMAX_DELAY);
    bool retVal = false;
    if (getDatamode() == AUDIO_LOCALFILE || m_streamType == ST_WEBSTREAM) {
        m_f_running = !m_f_running;
        retVal = true;
        if (!m_f_running) {
            memset(m_outBuff, 0, 2048 * 2 * sizeof(uint16_t)); // Clear OutputBuffer
            i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);
        }
    }
    xSemaphoreGive(mutex_audio);
    return retVal;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::playChunk()
{
    // If we've got data, try and pump it out..
    int16_t sample[2];
    if (getBitsPerSample() == 8) {
        if (getChannels() == 1) {
            while (m_validSamples) {
                uint8_t x = m_outBuff[m_curSample] & 0x00FF;
                uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
                sample[RIGHTCHANNEL] = x;
                sample[LEFTCHANNEL] = x;
                while (1) {
                    if (playSample(sample))
                        break;
                } // Can't send?
                sample[RIGHTCHANNEL] = y;
                sample[LEFTCHANNEL] = y;
                while (1) {
                    if (playSample(sample))
                        break;
                } // Can't send?
                m_validSamples--;
                m_curSample++;
            }
        }
        if (getChannels() == 2) {
            while (m_validSamples) {
                uint8_t x = m_outBuff[m_curSample] & 0x00FF;
                uint8_t y = (m_outBuff[m_curSample] & 0xFF00) >> 8;
                if (!m_f_forceMono) { // stereo mode
                    sample[RIGHTCHANNEL] = x;
                    sample[LEFTCHANNEL] = y;
                } else { // force mono
                    uint8_t xy = (x + y) / 2;
                    sample[RIGHTCHANNEL] = xy;
                    sample[LEFTCHANNEL] = xy;
                }

                while (1) {
                    if (playSample(sample))
                        break;
                } // Can't send?
                m_validSamples--;
                m_curSample++;
            }
        }
        m_curSample = 0;
        return true;
    }
    if (getBitsPerSample() == 16) {
        if (getChannels() == 1) {
            while (m_validSamples) {
                sample[RIGHTCHANNEL] = m_outBuff[m_curSample];
                sample[LEFTCHANNEL] = m_outBuff[m_curSample];
                if (!playSample(sample)) {
                    log_e("can't send");
                    return false;
                } // Can't send
                m_validSamples--;
                m_curSample++;
            }
        }
        if (getChannels() == 2) {
            m_curSample = 0;
            while (m_validSamples) {
                if (!m_f_forceMono) { // stereo mode
                    sample[RIGHTCHANNEL] = m_outBuff[m_curSample * 2];
                    sample[LEFTCHANNEL] = m_outBuff[m_curSample * 2 + 1];
                } else { // mono mode, #100
                    int16_t xy = (m_outBuff[m_curSample * 2] + m_outBuff[m_curSample * 2 + 1]) / 2;
                    sample[RIGHTCHANNEL] = xy;
                    sample[LEFTCHANNEL] = xy;
                }
                playSample(sample);
                m_validSamples--;
                m_curSample++;
            }
        }
        m_curSample = 0;
        return true;
    }
    log_e("BitsPer Sample must be 8 or 16!");
    m_validSamples = 0;
    stopSong();
    return false;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::loop()
{

    if (!m_f_running)
        return;

    xSemaphoreTake(mutex_audio, portMAX_DELAY);

    if (m_playlistFormat != FORMAT_M3U8) { // normal process
        switch (getDatamode()) {
        case AUDIO_LOCALFILE:
            processLocalFile();
            break;
        case HTTP_RESPONSE_HEADER:
            parseHttpResponseHeader();
            break;
        // case AUDIO_PLAYLISTINIT:
        //     readPlayListData();
        //     break;
        // case AUDIO_PLAYLISTDATA:
        //     if (m_playlistFormat == FORMAT_M3U)
        //         connecttohost(parsePlaylist_M3U());
        //     if (m_playlistFormat == FORMAT_PLS)
        //         connecttohost(parsePlaylist_PLS());
        //     if (m_playlistFormat == FORMAT_ASX)
        //         connecttohost(parsePlaylist_ASX());
        //     break;
        case AUDIO_DATA:
            if (m_streamType == ST_WEBSTREAM)
                processWebStream();
            if (m_streamType == ST_WEBFILE)
                processWebFile();
            break;
        }
    }
    // else
    // { // m3u8 datastream only
    //     static bool f_noNewHost = false;
    //     static int32_t remaintime, timestamp1, timestamp2; // m3u8 time management
    //     const char *host;

    //     switch (getDatamode())
    //     {
    //     case HTTP_RESPONSE_HEADER:
    //         playAudioData(); // fill I2S DMA buffer
    //         parseHttpResponseHeader();
    //         m_codec = CODEC_AAC;
    //         break;
    //     case AUDIO_PLAYLISTINIT:
    //         readPlayListData();
    //         break;
    //     case AUDIO_PLAYLISTDATA:
    //         host = parsePlaylist_M3U8();
    //         m_f_m3u8data = true;
    //         if (host)
    //         {
    //             f_noNewHost = false;
    //             timestamp1 = millis();
    //             httpPrint(host);
    //         }
    //         else
    //         {
    //             f_noNewHost = true;
    //             timestamp2 = millis() + remaintime;
    //             setDatamode(AUDIO_DATA); // fake datamode, we have no new audiosequence yet, so let audio run
    //         }
    //         break;
    //     case AUDIO_DATA:
    //         if (m_f_ts)
    //             processWebStreamTS(); // aac or aacp with ts packets
    //         else
    //             processWebStreamHLS(); // aac or aacp normal stream
    //         if (f_noNewHost)
    //         {
    //             m_f_continue = false;
    //             if (timestamp2 < millis())
    //             {
    //                 httpPrint(m_lastHost);
    //                 remaintime = 1000;
    //             }
    //         }
    //         else
    //         {
    //             if (m_f_continue)
    //             { // processWebStream() needs more data
    //                 remaintime = (int32_t)(m_m3u8_targetDuration * 1000) - (millis() - timestamp1);
    //                 //    if(m_m3u8_targetDuration < 10) remaintime += 1000;
    //                 m_f_continue = false;
    //                 setDatamode(AUDIO_PLAYLISTDATA);
    //             }
    //         }
    //         break;
    //     }
    // }
    xSemaphoreGive(mutex_audio);
}
//---------------------------------------------------------------------------------------------------------------------
// bool AudioHelpr::readPlayListData()
// {
//     // Serial.printf("aaaaaaaaaaaaaa7:");
//     if (getDatamode() != AUDIO_PLAYLISTINIT)
//         return false;
//     if (_client->available() == 0)
//         return false;

//     uint32_t chunksize = 0;
//     uint8_t readedBytes = 0;
//     if (m_f_chunked)
//         chunksize = chunkedDataTransfer(&readedBytes);

//     // reads the content of the playlist and stores it in the vector m_contentlength
//     // m_contentlength is a table of pointers to the lines
//     char pl[512] = {0}; // playlistLine
//     uint32_t ctl = 0;
//     int lines = 0;
//     // delete all memory in m_playlistContent
//     if (m_playlistFormat == FORMAT_M3U8 && !psramFound())
//     {
//         log_e("m3u8 playlists requires PSRAM enabled!");
//     }
//     vector_clear_and_shrink(m_playlistContent);
//     while (true)
//     { // outer while

