1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
//         uint32_t ctime = millis();
//         uint32_t timeout = 2000; // ms

//         while (true)
//         { // inner while
//             uint16_t pos = 0;
//             while (_client->available())
//             { // super inner while :-))
//                 pl[pos] = _client->read();
//                 ctl++;
//                 if (pl[pos] == '\n')
//                 {
//                     pl[pos] = '\0';
//                     pos++;
//                     break;
//                 }
//                 //    if(pl[pos] == '&' ) {pl[pos] = '\0'; pos++; break;}
//                 if (pl[pos] == '\r')
//                 {
//                     pl[pos] = '\0';
//                     pos++;
//                     continue;
//                     ;
//                 }
//                 pos++;
//                 if (pos == 511)
//                 {
//                     pos--;
//                     continue;
//                 }
//                 if (pos == 510)
//                 {
//                     pl[pos] = '\0';
//                 }
//                 if (ctl == chunksize)
//                 {
//                     pl[pos] = '\0';
//                     break;
//                 }
//                 if (ctl == m_contentlength)
//                 {
//                     pl[pos] = '\0';
//                     break;
//                 }
//             }
//             if (ctl == chunksize)
//                 break;
//             if (ctl == m_contentlength)
//                 break;
//             if (pos)
//             {
//                 pl[pos] = '\0';
//                 break;
//             }

//             if (ctime + timeout < millis())
//             {
//                 log_e("timeout");
//                 for (int i = 0; i < m_playlistContent.size(); i++)
//                     log_e("pl%i = %s", i, m_playlistContent[i]);
//                 goto exit;
//             }
//         } // inner while

//         if (startsWith(pl, "<!DOCTYPE"))
//         {
//             AUDIO_INFO("url is a webpage!");
//             goto exit;
//         }
//         if (startsWith(pl, "<html"))
//         {
//             AUDIO_INFO("url is a webpage!");
//             goto exit;
//         }
//         if (strlen(pl) > 0)
//             m_playlistContent.push_back(strdup((const char *)pl));
//         if (m_playlistContent.size() == 100)
//         {
//             if (m_f_Log)
//                 log_i("the maximum number of lines in the playlist has been reached");
//             break;
//         }
//         // termination conditions
//         // 1. The http response header returns a value for contentLength -> read chars until contentLength is reached
//         // 2. no contentLength, but Transfer-Encoding:chunked -> compute chunksize and read until chunksize is reached
//         // 3. no chunksize and no contentlengt, but Connection: close -> read all available chars
//         if (ctl == m_contentlength)
//         {
//             while (_client->available())
//                 _client->read();
//             break;
//         } // read '\n\n' if exists
//         if (ctl == chunksize)
//         {
//             while (_client->available())
//                 _client->read();
//             break;
//         }
//         if (!_client->connected() && _client->available() == 0)
//             break;

//     } // outer while
//     lines = m_playlistContent.size();
//     for (int i = 0; i < lines; i++)
//     { // print all string in first vector of 'arr'
//         if (m_f_Log)
//             log_i("pl=%i \"%s\"", i, m_playlistContent[i]);
//     }
//     setDatamode(AUDIO_PLAYLISTDATA);
//     return true;

// exit:
//     vector_clear_and_shrink(m_playlistContent);
//     m_f_running = false;
//     setDatamode(AUDIO_NONE);
//     return false;
// }
//----------------------------------------------------------------------------------------------------------------------
// const char *AudioHelpr::parsePlaylist_M3U()
// {
//     uint8_t lines = m_playlistContent.size();
//     int pos = 0;
//     char *host = nullptr;

//     for (int i = 0; i < lines; i++)
//     {
//         if (indexOf(m_playlistContent[i], "#EXTINF:") >= 0)
//         {                                             // Info?
//             pos = indexOf(m_playlistContent[i], ","); // Comma in this line?
//             if (pos > 0)
//             {
//                 // Show artist and title if present in metadata
//                 AUDIO_INFO(m_playlistContent[i] + pos + 1);
//             }
//             continue;
//         }
//         if (startsWith(m_playlistContent[i], "#"))
//         { // Commentline?
//             continue;
//         }

//         pos = indexOf(m_playlistContent[i], "http://:@", 0); // ":@"??  remove that!
//         if (pos >= 0)
//         {
//             AUDIO_INFO("Entry in playlist found: %s", (m_playlistContent[i] + pos + 9));
//             host = m_playlistContent[i] + pos + 9;
//             break;
//         }
//         // AUDIO_INFO("Entry in playlist found: %s", pl);
//         pos = indexOf(m_playlistContent[i], "http", 0); // Search for "http"
//         if (pos >= 0)
//         {                                      // Does URL contain "http://"?
//                                                //    log_e("%s pos=%i", m_playlistContent[i], pos);
//             host = m_playlistContent[i] + pos; // Yes, set new host
//             break;
//         }
//     }
//     //    vector_clear_and_shrink(m_playlistContent);
//     return host;
// }
//----------------------------------------------------------------------------------------------------------------------
// const char *AudioHelpr::parsePlaylist_PLS()
// {
//     uint8_t lines = m_playlistContent.size();
//     int pos = 0;
//     char *host = nullptr;

//     for (int i = 0; i < lines; i++)
//     {
//         if (i == 0)
//         {
//             if (strlen(m_playlistContent[0]) == 0)
//                 goto exit; // empty line
//             if (strcmp(m_playlistContent[0], "[playlist]") != 0)
//             {                                      // first entry in valid pls
//                 setDatamode(HTTP_RESPONSE_HEADER); // pls is not valid
//                 AUDIO_INFO("pls is not valid, switch to HTTP_RESPONSE_HEADER");
//                 goto exit;
//             }
//             continue;
//         }
//         if (startsWith(m_playlistContent[i], "File1"))
//         {
//             if (host)
//                 continue;                                   // we have already a url
//             pos = indexOf(m_playlistContent[i], "http", 0); // File1=http://streamplus30.leonex.de:14840/;
//             if (pos >= 0)
//             {                                      // yes, URL contains "http"?
//                 host = m_playlistContent[i] + pos; // Now we have an URL for a stream in host.
//             }
//             continue;
//         }
//         if (startsWith(m_playlistContent[i], "Title1"))
//         { // Title1=Antenne Tirol
//             const char *plsStationName = (m_playlistContent[i] + 7);
//             if (audio_showstation)
//                 audio_showstation(plsStationName);
//             AUDIO_INFO("StationName: \"%s\"", plsStationName);
//             continue;
//         }
//         if (startsWith(m_playlistContent[i], "Length1"))
//         {
//             continue;
//         }
//         if (indexOf(m_playlistContent[i], "Invalid username") >= 0)
//         {              // Unable to access account:
//             goto exit; // Invalid username or password
//         }
//     }
//     return host;

// exit:
//     m_f_running = false;
//     stopSong();
//     vector_clear_and_shrink(m_playlistContent);
//     setDatamode(AUDIO_NONE);
//     return nullptr;
// }
// //----------------------------------------------------------------------------------------------------------------------
// const char *AudioHelpr::parsePlaylist_ASX()
// { // Advanced Stream Redirector
//     uint8_t lines = m_playlistContent.size();
//     bool f_entry = false;
//     int pos = 0;
//     char *host = nullptr;

//     for (int i = 0; i < lines; i++)
//     {
//         int p1 = indexOf(m_playlistContent[i], "<", 0);
//         int p2 = indexOf(m_playlistContent[i], ">", 1);
//         if (p1 >= 0 && p2 > p1)
//         { // #196 set all between "< ...> to lowercase
//             for (uint8_t j = p1; j < p2; j++)
//             {
//                 m_playlistContent[i][j] = toLowerCase(m_playlistContent[i][j]);
//             }
//         }
//         if (indexOf(m_playlistContent[i], "<entry>") >= 0)
//             f_entry = true; // found entry tag (returns -1 if not found)
//         if (f_entry)
//         {
//             if (indexOf(m_playlistContent[i], "ref href") > 0)
//             { //  <ref href="http://87.98.217.63:24112/stream" />
//                 pos = indexOf(m_playlistContent[i], "http", 0);
//                 if (pos > 0)
//                 {
//                     host = (m_playlistContent[i] + pos); // http://87.98.217.63:24112/stream" />
//                     int pos1 = indexOf(host, "\"", 0);   // http://87.98.217.63:24112/stream
//                     if (pos1 > 0)
//                         host[pos1] = '\0'; // Now we have an URL for a stream in host.
//                 }
//             }
//         }
//         pos = indexOf(m_playlistContent[i], "<title>", 0);
//         if (pos >= 0)
//         {
//             char *plsStationName = (m_playlistContent[i] + pos + 7); // remove <Title>
//             pos = indexOf(plsStationName, "</", 0);
//             if (pos >= 0)
//             {
//                 *(plsStationName + pos) = 0; // remove </Title>
//             }
//             if (audio_showstation)
//                 audio_showstation(plsStationName);
//             AUDIO_INFO("StationName: \"%s\"", plsStationName);
//         }

