1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
//         if (indexOf(m_playlistContent[i], "http") == 0 && !f_entry)
//         { // url only in asx
//             host = m_playlistContent[i];
//         }
//     }
//     return host;
// }
// //----------------------------------------------------------------------------------------------------------------------
// const char *AudioHelpr::parsePlaylist_M3U8()
// {
//     uint8_t lines = m_playlistContent.size();
//     bool f_begin = false;
//     uint8_t occurence = 0;
//     if (lines)
//     {
//         for (int i = 0; i < lines; i++)
//         {
//             if (strlen(m_playlistContent[i]) == 0)
//                 continue; // empty line
//             if (startsWith(m_playlistContent[i], "#EXTM3U"))
//             { // what we expected
//                 f_begin = true;
//                 continue;
//             }
//             if (!f_begin)
//                 continue;

//             // example: redirection
//             // #EXTM3U
//             // #EXT-X-STREAM-INF:BANDWIDTH=22050,CODECS="mp4a.40.2"
//             // http://ample.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/playlist.m3u8
//             if (startsWith(m_playlistContent[i], "#EXT-X-STREAM-INF:"))
//             {
//                 if (occurence > 0)
//                     break; // no more than one #EXT-X-STREAM-INF: (can have different BANDWIDTH)
//                 occurence++;
//                 if ((!endsWith(m_playlistContent[i + 1], "m3u8") && indexOf(m_playlistContent[i + 1], "m3u8?") == -1))
//                 {
//                     // we have a new m3u8 playlist, skip to next line
//                     int pos = indexOf(m_playlistContent[i], "CODECS=\"mp4a", 18);
//                     // 'mp4a.40.01' AAC Main
//                     // 'mp4a.40.02' AAC LC (Low Complexity)
//                     // 'mp4a.40.03' AAC SSR (Scalable Sampling Rate) ??
//                     // 'mp4a.40.03' AAC LTP (Long Term Prediction) ??
//                     // 'mp4a.40.03' SBR (Spectral Band Replication)
//                     if (pos < 0)
//                     { // not found
//                         int pos1 = indexOf(m_playlistContent[i], "CODECS=", 18);
//                         if (pos1 < 0)
//                             pos1 = 0;
//                         log_e("codec %s in m3u8 playlist not supported", m_playlistContent[i] + pos1);
//                         goto exit;
//                     }
//                 }
//                 i++; // next line
//                 if (i == lines)
//                     continue; // and exit for()

//                 char *tmp = nullptr;
//                 if (!startsWith(m_playlistContent[i], "http"))
//                 {
//                     // http://livees.com/prog_index.m3u8 and prog_index48347.aac --> http://livees.com/prog_index48347.aac
//                     // http://livees.com/prog_index.m3u8 and chunklist022.m3u8   --> http://livees.com/chunklist022.m3u8
//                     tmp = (char *)malloc(strlen(m_lastHost) + strlen(m_playlistContent[i]));
//                     strcpy(tmp, m_lastHost);
//                     int idx = lastIndexOf(tmp, "/");
//                     strcpy(tmp + idx + 1, m_playlistContent[i]);
//                 }
//                 else
//                 {
//                     tmp = strdup(m_playlistContent[i]);
//                 }
//                 if (m_playlistContent[i])
//                 {
//                     free(m_playlistContent[i]);
//                     m_playlistContent[i] = NULL;
//                 }
//                 m_playlistContent[i] = strdup(tmp);
//                 strcpy(m_lastHost, tmp);
//                 if (tmp)
//                 {
//                     free(tmp);
//                     tmp = NULL;
//                 }
//                 if (m_f_Log)
//                     log_i("redirect %s", m_playlistContent[i]);
//                 _client->stop();
//                 return m_playlistContent[i]; // it's a redirection, a new m3u8 playlist
//             }

//             // example: audio chunks
//             // #EXTM3U
//             // #EXT-X-TARGETDURATION:10
//             // #EXT-X-MEDIA-SEQUENCE:163374040
//             // #EXT-X-DISCONTINUITY
//             // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
//             // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374038.aac
//             // #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
//             // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374039.aac
//             if (startsWith(m_playlistContent[i], "#EXT-X-MEDIA-SEQUENCE:"))
//             {
//                 // do nothing, because MEDIA-SECUENCE is not set sometimes
//             }
//             static uint16_t targetDuration = 0;
//             if (startsWith(m_playlistContent[i], "#EXT-X-TARGETDURATION:"))
//             {
//                 targetDuration = atoi(m_playlistContent[i] + 22);
//             }
//             if (targetDuration)
//                 m_m3u8_targetDuration = targetDuration;
//             if (m_f_Log)
//                 log_i("m_m3u8_targetDuration %d", m_m3u8_targetDuration);

//             if (startsWith(m_playlistContent[i], "#EXTINF"))
//             {
//                 if (STfromEXTINF(m_playlistContent[i]))
//                     showstreamtitle(m_chbuf);
//                 i++;
//                 if (i == lines)
//                     continue; // and exit for()

//                 char *tmp = nullptr;
//                 if (!startsWith(m_playlistContent[i], "http"))
//                 {
//                     // http://livees.com/prog_index.m3u8 and prog_index48347.aac --> http://livees.com/prog_index48347.aac
//                     tmp = (char *)malloc(strlen(m_lastHost) + strlen(m_playlistContent[i]));
//                     strcpy(tmp, m_lastHost);
//                     int idx = lastIndexOf(tmp, "/");
//                     strcpy(tmp + idx + 1, m_playlistContent[i]);
//                 }
//                 else
//                 {
//                     tmp = strdup(m_playlistContent[i]);
//                 }

//                 uint32_t hash = simpleHash(tmp);
//                 if (m_hashQueue.size() == 0)
//                 {
//                     m_hashQueue.insert(m_hashQueue.begin(), hash);
//                     m_playlistURL.insert(m_playlistURL.begin(), strdup(tmp));
//                 }
//                 else
//                 {
//                     bool known = false;
//                     for (int i = 0; i < m_hashQueue.size(); i++)
//                     {
//                         if (hash == m_hashQueue[i])
//                         {
//                             if (m_f_Log)
//                                 log_i("file already known %s", tmp);
//                             known = true;
//                         }
//                     }
//                     if (!known)
//                     {
//                         m_hashQueue.insert(m_hashQueue.begin(), hash);
//                         m_playlistURL.insert(m_playlistURL.begin(), strdup(tmp));
//                     }
//                 }

