1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
//                 if (m_hashQueue.size() > 20)
//                     m_hashQueue.pop_back();

//                 if (tmp)
//                 {
//                     free(tmp);
//                     tmp = NULL;
//                 }

//                 if (m_playlistURL.size() == 20)
//                 {
//                     ESP_LOGD("", "can't stuff anymore");
//                     break;
//                 }
//                 continue;
//             }
//         }
//         vector_clear_and_shrink(m_playlistContent); // clear after reading everything, m_playlistContent.size is now 0
//     }

//     if (m_playlistURL.size() > 0)
//     {
//         if (m_playlistBuff)
//         {
//             free(m_playlistBuff);
//             m_playlistBuff = NULL;
//         }

//         if (m_playlistURL[m_playlistURL.size() - 1])
//         {
//             m_playlistBuff = strdup(m_playlistURL[m_playlistURL.size() - 1]);
//             free(m_playlistURL[m_playlistURL.size() - 1]);
//             m_playlistURL[m_playlistURL.size() - 1] = NULL;
//             m_playlistURL.pop_back();
//             m_playlistURL.shrink_to_fit();
//         }
//         if (m_f_Log)
//             log_i("now playing %s", m_playlistBuff);
//         if (endsWith(m_playlistBuff, "ts"))
//             m_f_ts = true;
//         return m_playlistBuff;
//     }
//     else
//     {
//         return NULL;
//     }
// exit:
//     stopSong();
//     return NULL;
// }
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::STfromEXTINF(char *str)
{
    // the result is copied in chbuf!!
    // extraxt StreamTitle from m3u #EXTINF line to icy-format
    // orig: #EXTINF:10,title="text="TitleName",artist="ArtistName"
    // conv: StreamTitle=TitleName - ArtistName
    // orig: #EXTINF:10,title="text=\"Spot Block End\" amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
    // conv: StreamTitle=text=\"Spot Block End\" amgTrackId=\"9876543\" -

    int t1, t2, t3, n0 = 0, n1 = 0, n2 = 0;

    t1 = indexOf(str, "title", 0);
    if (t1 > 0) {
        strcpy(m_chbuf, "StreamTitle=");
        n0 = 12;
        t2 = t1 + 7; // title="
        t3 = indexOf(str, "\"", t2);
        while (str[t3 - 1] == '\\') {
            t3 = indexOf(str, "\"", t3 + 1);
        }
        if (t2 < 0 || t2 > t3)
            return false;
        n1 = t3 - t2;
        strncpy(m_chbuf + n0, str + t2, n1);
        m_chbuf[n0 + n1] = '\0';
    }
    t1 = indexOf(str, "artist", 0);
    if (t1 > 0) {
        strcpy(m_chbuf + n0 + n1, " - ");
        n1 += 3;
        t2 = indexOf(str, "=\"", t1);
        t2 += 2;
        t3 = indexOf(str, "\"", t2);
        if (t2 < 0 || t2 > t3)
            return false;
        n2 = t3 - t2;
        strncpy(m_chbuf + n0 + n1, str + t2, n2);
        m_chbuf[n0 + n1 + n2] = '\0';
    }
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::processLocalFile()
{

    if (!(audiofile && m_f_running && getDatamode() == AUDIO_LOCALFILE))
        return; // guard

    static uint32_t ctime = 0;
    const uint32_t timeout = 2500;                          // ms
    const uint32_t maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    static bool f_stream;
    static bool f_fileDataComplete;
    static uint32_t byteCounter; // count received data
    uint32_t availableBytes = 0;

    if (m_f_firstCall) { // runs only one time per connection, prepare for start
        m_f_firstCall = false;
        f_stream = false;
        f_fileDataComplete = false;
        byteCounter = 0;
        ctime = millis();
        if (m_codec == CODEC_M4A)
            seek_m4a_stsz(); // determine the pos of atom stsz
        if (m_codec == CODEC_M4A)
            seek_m4a_ilst(); // looking for metadata
        return;
    }

    availableBytes = 16 * 1024; // set some large value

    availableBytes = min(availableBytes, (uint32_t)InBuff.writeSpace());
    availableBytes = min(availableBytes, audiofile.size() - byteCounter);
    if (m_contentlength) {
        if (m_contentlength > getFilePos())
            availableBytes = min(availableBytes, m_contentlength - getFilePos());
    }
    if (m_audioDataSize) {
        availableBytes = min(availableBytes, m_audioDataSize + m_audioDataStart - byteCounter);
    }

    int32_t bytesAddedToBuffer = audiofile.read(InBuff.getWritePtr(), availableBytes);

    if (bytesAddedToBuffer > 0) {
        byteCounter += bytesAddedToBuffer; // Pull request #42
        InBuff.bytesWritten(bytesAddedToBuffer);
    }
    if (!f_stream) {
        if (m_codec == CODEC_OGG) { // log_i("determine correct codec here");
            uint8_t codec = determineOggCodec(InBuff.getReadPtr(), maxFrameSize);
            if (codec == CODEC_FLAC) {
                m_codec = CODEC_FLAC;
                initializeDecoder();
                return;
            }
            if (codec == CODEC_OPUS) {
                m_codec = CODEC_OPUS;
                initializeDecoder();
                return;
            }
            if (codec == CODEC_VORBIS) {
                m_codec = CODEC_VORBIS;
                initializeDecoder();
                return;
            }
            stopSong();
            return;
        }
        if (m_controlCounter != 100) {
            if ((millis() - ctime) > timeout) {
                log_e("audioHeader reading timeout");
                m_f_running = false;
                return;
            }
            if (InBuff.bufferFilled() > maxFrameSize) { // read the file header first
                InBuff.bytesWasRead(readAudioHeader(InBuff.bufferFilled()));
            }
            return;
        } else {
            if ((InBuff.freeSpace() > maxFrameSize) && (m_file_size - byteCounter) > maxFrameSize && availableBytes) {
                // fill the buffer before playing
                return;
            }

            f_stream = true;
            AUDIO_INFO("stream ready");
            if (m_f_Log)
                log_i("m_audioDataStart %d", m_audioDataStart);
        }
    }

