1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (m_resumeFilePos >= 0) {
        if (m_resumeFilePos < m_audioDataStart)
            m_resumeFilePos = m_audioDataStart;
        if (m_resumeFilePos > m_file_size)
            m_resumeFilePos = m_file_size;
        // if (m_codec == CODEC_M4A)
        //     m_resumeFilePos = m4a_correctResumeFilePos(m_resumeFilePos);
        // if (m_codec == CODEC_WAV)
        // {
        //     while ((m_resumeFilePos % 4) != 0)
        //         m_resumeFilePos++;
        // } // must be divisible by four
        // if (m_codec == CODEC_FLAC)
        // {
        //     m_resumeFilePos = flac_correctResumeFilePos(m_resumeFilePos);
        //     FLACDecoderReset();
        // }
        if (m_codec == CODEC_MP3) {
            m_resumeFilePos = mp3_correctResumeFilePos(m_resumeFilePos);
        }
        if (m_avr_bitrate)
            m_audioCurrentTime = ((m_resumeFilePos - m_audioDataStart) / m_avr_bitrate) * 8;
        audiofile.seek(m_resumeFilePos);
        InBuff.resetBuffer();
        byteCounter = m_resumeFilePos;

        if (m_f_Log) {
            log_i("m_resumeFilePos %i", m_resumeFilePos);
            log_i("m_audioDataStart %d", m_audioDataStart);
            log_i("m_audioCurrentTime %f", (double)m_audioCurrentTime);
            log_i("m_file_size %d", m_file_size);
        }
        m_resumeFilePos = -1;
        f_stream = false;
    }

    // end of file reached? - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_fileDataComplete && InBuff.bufferFilled() < InBuff.getMaxBlockSize()) {

        if (InBuff.bufferFilled()) {
            if (!readID3V1Tag()) {
                int bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
                if (bytesDecoded <= InBuff.bufferFilled()) { // avoid InBuff overrun (can be if file is corrupt)
                    if (m_f_playing) {
                        if (bytesDecoded > 2) {
                            InBuff.bytesWasRead(bytesDecoded);
                            return;
                        }
                    }
                }
                AUDIO_INFO("audio file is corrupt --> send EOF"); // no return, fall through
            }
        }

        if (m_f_loop && f_stream) {                                             // eof
            AUDIO_INFO("loop from: %u to: %u", getFilePos(), m_audioDataStart); // loop
            setFilePos(m_audioDataStart);
            // if (m_codec == CODEC_FLAC)
            //     FLACDecoderReset();
            m_audioCurrentTime = 0;
            byteCounter = m_audioDataStart;
            f_fileDataComplete = false;
            return;
        } // loop

        char *afn = strdup(audiofile.name()); // store temporary the name
        m_f_running = false;
        m_streamType = ST_NONE;
        audiofile.close();
        AUDIO_INFO("Closing audio file");

        if (m_codec == CODEC_MP3)
            MP3Decoder_FreeBuffers();
        // if (m_codec == CODEC_AAC)
        //     AACDecoder_FreeBuffers();
        // if (m_codec == CODEC_M4A)
        //     AACDecoder_FreeBuffers();
        // if (m_codec == CODEC_FLAC)
        //     FLACDecoder_FreeBuffers();
        // if (m_codec == CODEC_OPUS)
        //     OPUSDecoder_FreeBuffers();
        // if (m_codec == CODEC_VORBIS)
        //     VORBISDecoder_FreeBuffers();
        AUDIO_INFO("End of file \"%s\"", afn);
        if (audio_eof_mp3)
            audio_eof_mp3(afn);
        if (afn) {
            free(afn);
            afn = NULL;
        }
        return;
    }

    if (byteCounter == audiofile.size()) {
        f_fileDataComplete = true;
    }
    if (byteCounter == m_audioDataSize + m_audioDataStart) {
        f_fileDataComplete = true;
    }

    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        static uint8_t cnt = 0;
        uint8_t compression;
        if (m_codec == CODEC_WAV)
            compression = 1;
        if (m_codec == CODEC_FLAC)
            compression = 2;
        else
            compression = 3;
        cnt++;
        if (cnt == compression) {
            playAudioData();
            cnt = 0;
        }
    }
}
//----------------------------------------------------------------------------------------------------------------------
void AudioHelpr::processWebStream()
{
    // Serial.printf("aaaaaaaaaaaaaa0:");
    const uint16_t maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    static bool f_stream;                                   // first audio data received
    static uint32_t chunkSize;                              // chunkcount read from stream

    // first call, set some values to default  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_firstCall) { // runs only ont time per connection, prepare for start
        m_f_firstCall = false;
        f_stream = false;
        chunkSize = 0;
        m_metacount = m_metaint;
        readMetadata(0, true); // reset all static vars
    }

    if (getDatamode() != AUDIO_DATA)
        return;                                     // guard
    uint32_t availableBytes = _client->available(); // available from stream
    // chunked data tramsfer - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_chunked && availableBytes) {
        uint8_t readedBytes = 0;
        if (!chunkSize)
            chunkSize = chunkedDataTransfer(&readedBytes);
        availableBytes = min(availableBytes, chunkSize);
    }
    // we have metadata  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_metadata && availableBytes) {
        if (m_metacount == 0) {
            chunkSize -= readMetadata(availableBytes);
            return;
        }
        availableBytes = min(availableBytes, m_metacount);
    }

    // if the buffer is often almost empty issue a warning - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        if (streamDetection(availableBytes))
            return;
    }

    // buffer fill routine - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (availableBytes) {
        availableBytes = min(availableBytes, (uint32_t)InBuff.writeSpace());
        int16_t bytesAddedToBuffer = _client->read(InBuff.getWritePtr(), availableBytes);
        if (bytesAddedToBuffer > 0) {
            if (m_f_metadata)
                m_metacount -= bytesAddedToBuffer;
            if (m_f_chunked)
                chunkSize -= bytesAddedToBuffer;
            InBuff.bytesWritten(bytesAddedToBuffer);
        }

        if (InBuff.bufferFilled() > maxFrameSize && !f_stream) { // waiting for buffer filled
            f_stream = true;                                     // ready to play the audio data
            AUDIO_INFO("stream ready");
        }
        if (!f_stream)
            return;
        if (m_codec == CODEC_OGG) { // log_i("determine correct codec here");
            uint8_t codec = determineOggCodec(InBuff.getReadPtr(), maxFrameSize);
            if (codec == CODEC_FLAC) {
                m_codec = CODEC_FLAC;
                initializeDecoder();
                return;
            }
            if (codec == CODEC_OPUS) {
                m_codec = CODEC_OPUS;
                initializeDecoder();
                return;
            }
            if (codec == CODEC_VORBIS) {
                m_codec = CODEC_VORBIS;
                initializeDecoder();
                return;
            }
            stopSong();
            return;
        }
    }

