1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        static uint8_t cnt = 0;
        uint8_t compression;
        if (m_codec == CODEC_WAV)
            compression = 1;
        if (m_codec == CODEC_FLAC)
            compression = 2;
        else
            compression = 3;
        cnt++;
        if (cnt == compression) {
            playAudioData();
            cnt = 0;
        }
    }
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::processWebFile()
{

    const uint32_t maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    static bool f_stream;                                   // first audio data received
    static bool f_webFileDataComplete;                      // all file data received
    static uint32_t byteCounter;                            // count received data
    static uint32_t chunkSize;                              // chunkcount read from stream
    static size_t audioDataCount;                           // counts the decoded audiodata only

    // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_firstCall) { // runs only ont time per connection, prepare for start
        m_f_firstCall = false;
        m_t0 = millis();
        f_webFileDataComplete = false;
        f_stream = false;
        byteCounter = 0;
        chunkSize = 0;
        audioDataCount = 0;
    }

    if (!m_contentlength && !m_f_tts) {
        log_e("webfile without contentlength!");
        stopSong();
        return;
    } // guard

    uint32_t availableBytes = _client->available(); // available from stream

    // chunked data tramsfer - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_chunked) {
        uint8_t readedBytes = 0;
        if (!chunkSize)
            chunkSize = chunkedDataTransfer(&readedBytes);
        availableBytes = min(availableBytes, chunkSize);
        if (m_f_tts)
            m_contentlength = chunkSize;
    }

    // if the buffer is often almost empty issue a warning - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (!f_webFileDataComplete && f_stream) {
        if (streamDetection(availableBytes))
            return;
    }

    availableBytes = min((uint32_t)InBuff.writeSpace(), availableBytes);
    availableBytes = min(m_contentlength - byteCounter, availableBytes);
    if (m_audioDataSize)
        availableBytes = min(m_audioDataSize - (byteCounter - m_audioDataStart), availableBytes);

    int16_t bytesAddedToBuffer = _client->read(InBuff.getWritePtr(), availableBytes);

    if (bytesAddedToBuffer > 0) {
        byteCounter += bytesAddedToBuffer; // Pull request #42
        if (m_f_chunked)
            m_chunkcount -= bytesAddedToBuffer;
        if (m_controlCounter == 100)
            audioDataCount += bytesAddedToBuffer;
        InBuff.bytesWritten(bytesAddedToBuffer);
    }

    if (!f_stream) {
        if ((InBuff.freeSpace() > maxFrameSize) && (byteCounter < m_contentlength))
            return;
        f_stream = true; // ready to play the audio data
        uint16_t filltime = millis() - m_t0;
        AUDIO_INFO("stream ready, buffer filled in %d ms", filltime);
        return;
    }

    // we have a webfile, read the file header first - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_controlCounter != 100) {
        if (InBuff.bufferFilled() > maxFrameSize) { // read the file header first
            int32_t bytesRead = readAudioHeader(maxFrameSize);
            if (bytesRead > 0)
                InBuff.bytesWasRead(bytesRead);
        }
        return;
    }

    if (m_codec == CODEC_OGG) { // log_i("determine correct codec here");
        uint8_t codec = determineOggCodec(InBuff.getReadPtr(), maxFrameSize);
        if (codec == CODEC_FLAC) {
            m_codec = CODEC_FLAC;
            initializeDecoder();
            return;
        }
        if (codec == CODEC_OPUS) {
            m_codec = CODEC_OPUS;
            initializeDecoder();
            return;
        }
        if (codec == CODEC_VORBIS) {
            m_codec = CODEC_VORBIS;
            initializeDecoder();
            return;
        }
        stopSong();
        return;
    }

    // end of webfile reached? - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_webFileDataComplete && InBuff.bufferFilled() < InBuff.getMaxBlockSize()) {
        if (InBuff.bufferFilled()) {
            if (!readID3V1Tag()) {
                int bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
                if (bytesDecoded > 2) {
                    InBuff.bytesWasRead(bytesDecoded);
                    return;
                }
            }
        }

        m_f_running = false;
        m_streamType = ST_NONE;
        delay(200);
        isplaying = 0;
        if (m_codec == CODEC_MP3)
            MP3Decoder_FreeBuffers();

        // if (m_codec == CODEC_AAC)
        //     AACDecoder_FreeBuffers();
        // if (m_codec == CODEC_M4A)
        //     AACDecoder_FreeBuffers();
        // if (m_codec == CODEC_FLAC)
        //     FLACDecoder_FreeBuffers();
        // if (m_codec == CODEC_OPUS)
        //     OPUSDecoder_FreeBuffers();
        // if (m_codec == CODEC_VORBIS)
        //     VORBISDecoder_FreeBuffers();

        if (m_f_tts) {
            AUDIO_INFO("End of speech: \"%s\"", m_lastHost);
            if (audio_eof_speech)
                audio_eof_speech(m_lastHost);
        } else {
            AUDIO_INFO("End of webstream: \"%s\"", m_lastHost);
            if (audio_eof_stream)
                audio_eof_stream(m_lastHost);
        }
        return;
    }

    if (byteCounter == m_contentlength) {
        f_webFileDataComplete = true;
    }
    if (byteCounter - m_audioDataStart == m_audioDataSize) {
        f_webFileDataComplete = true;
    }

