1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        static uint8_t cnt = 0;
        uint8_t compression;
        if (m_codec == CODEC_WAV)
            compression = 1;
        if (m_codec == CODEC_FLAC)
            compression = 2;
        else
            compression = 3;
        cnt++;
        if (cnt == compression) {
            playAudioData();
            cnt = 0;
        }
    }
    return;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::processWebStreamTS()
{
    // Serial.printf("aaaaaaaaaaaaaa2:");
    const uint16_t maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    uint32_t availableBytes;                                // available bytes in stream
    static bool f_stream;                                   // first audio data received
    static bool f_firstPacket;
    static uint32_t byteCounter;   // count received data
    static uint8_t ts_packet[188]; // m3u8 transport stream is 188 bytes long
    uint8_t ts_packetStart = 0;
    uint8_t ts_packetLength = 0;
    static uint8_t ts_packetPtr = 0;
    const uint8_t ts_packetsize = 188;
    static size_t chunkSize = 0;

    // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_firstCall) { // runs only ont time per connection, prepare for start
        f_stream = false;
        f_firstPacket = true;
        byteCounter = 0;
        chunkSize = 0;
        m_t0 = millis();
        ts_packetPtr = 0;
        m_controlCounter = 0;
        m_f_firstCall = false;
    }

    if (getDatamode() != AUDIO_DATA)
        return; // guard

    if (InBuff.freeSpace() < maxFrameSize && f_stream) {
        playAudioData();
        return;
    }

    availableBytes = _client->available();
    if (availableBytes) {
        uint8_t readedBytes = 0;
        if (m_f_chunked)
            chunkSize = chunkedDataTransfer(&readedBytes);
        int res = _client->read(ts_packet + ts_packetPtr, ts_packetsize - ts_packetPtr);
        if (res > 0) {
            ts_packetPtr += res;
            byteCounter += res;
            if (ts_packetPtr < ts_packetsize)
                return;
            ts_packetPtr = 0;
            if (f_firstPacket) { // search for ID3 Header in the first packet
                f_firstPacket = false;
                uint8_t ID3_HeaderSize = process_m3u8_ID3_Header(ts_packet);
                if (ID3_HeaderSize > ts_packetsize) {
                    log_e("ID3 Header is too big");
                    stopSong();
                    return;
                }
                if (ID3_HeaderSize) {
                    memcpy(ts_packet, &ts_packet[ID3_HeaderSize], ts_packetsize - ID3_HeaderSize);
                    ts_packetPtr = ts_packetsize - ID3_HeaderSize;
                    return;
                }
            }
            ts_parsePacket(&ts_packet[0], &ts_packetStart, &ts_packetLength);

            if (ts_packetLength) {
                size_t ws = InBuff.writeSpace();
                if (ws >= ts_packetLength) {
                    memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart, ts_packetLength);
                    InBuff.bytesWritten(ts_packetLength);
                } else {
                    memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart, ws);
                    InBuff.bytesWritten(ws);
                    memcpy(InBuff.getWritePtr(), &ts_packet[ws + ts_packetStart], ts_packetLength - ws);
                    InBuff.bytesWritten(ts_packetLength - ws);
                }
            }
            if (byteCounter == m_contentlength || byteCounter == chunkSize) {
                byteCounter = 0;
                m_f_continue = true;
            }
            if (byteCounter > m_contentlength)
                log_e("byteCounter overflow");
        }
    }

    // if the buffer is often almost empty issue a warning - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        if (streamDetection(availableBytes))
            return;
    }

    // buffer fill routine  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (true) {                                                  // statement has no effect
        if (InBuff.bufferFilled() > maxFrameSize && !f_stream) { // waiting for buffer filled
            f_stream = true;                                     // ready to play the audio data
            uint16_t filltime = millis() - m_t0;
            if (m_f_Log)
                AUDIO_INFO("stream ready");
            if (m_f_Log)
                AUDIO_INFO("buffer filled in %d ms", filltime);
        }
        if (!f_stream)
            return;
    }

    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        static uint8_t cnt = 0;
        cnt++;
        if (cnt == 3) {
            playAudioData();
            cnt = 0;
        } // aac only
    }
    return;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::processWebStreamHLS()
{
    // Serial.printf("aaaaaaaaaaaaaa3:");
    const uint16_t maxFrameSize = InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
    const uint16_t ID3BuffSize = 1024;
    uint32_t availableBytes; // available bytes in stream
    static bool f_stream;    // first audio data received
    static bool firstBytes;
    static uint32_t byteCounter; // count received data
    static size_t chunkSize = 0;
    static uint16_t ID3WritePtr;
    static uint16_t ID3ReadPtr;
    static uint8_t *ID3Buff;

    // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_firstCall) { // runs only ont time per connection, prepare for start
        f_stream = false;
        byteCounter = 0;
        chunkSize = 0;
        ID3WritePtr = 0;
        ID3ReadPtr = 0;
        m_t0 = millis();
        m_f_firstCall = false;
        firstBytes = true;
        ID3Buff = (uint8_t *)malloc(ID3BuffSize);
        m_controlCounter = 0;
    }

