1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (getDatamode() != AUDIO_DATA)
        return; // guard

    availableBytes = _client->available();
    if (availableBytes) { // an ID3 header could come here
        uint8_t readedBytes = 0;

        if (m_f_chunked && !chunkSize) {
            chunkSize = chunkedDataTransfer(&readedBytes);
            byteCounter += readedBytes;
        }

        if (firstBytes) {
            if (ID3WritePtr < ID3BuffSize) {
                ID3WritePtr += _client->readBytes(&ID3Buff[ID3WritePtr], ID3BuffSize - ID3WritePtr);
                return;
            }
            if (m_controlCounter < 100) {
                int res = read_ID3_Header(&ID3Buff[ID3ReadPtr], ID3BuffSize - ID3ReadPtr);
                if (res >= 0)
                    ID3ReadPtr += res;
                if (ID3ReadPtr > ID3BuffSize) {
                    log_e("buffer overflow");
                    stopSong();
                    return;
                }
                return;
            }
            if (m_controlCounter != 100)
                return;

            size_t ws = InBuff.writeSpace();
            if (ws >= ID3BuffSize - ID3ReadPtr) {
                memcpy(InBuff.getWritePtr(), &ID3Buff[ID3ReadPtr], ID3BuffSize - ID3ReadPtr);
                InBuff.bytesWritten(ID3BuffSize - ID3ReadPtr);
            } else {
                memcpy(InBuff.getWritePtr(), &ID3Buff[ID3ReadPtr], ws);
                InBuff.bytesWritten(ws);
                memcpy(InBuff.getWritePtr(), &ID3Buff[ws + ID3ReadPtr], ID3BuffSize - (ID3ReadPtr + ws));
                InBuff.bytesWritten(ID3BuffSize - (ID3ReadPtr + ws));
            }
            if (ID3Buff)
                free(ID3Buff);
            byteCounter += ID3BuffSize;
            ID3Buff = NULL;
            firstBytes = false;
        }

        size_t bytesWasWritten = 0;
        if (InBuff.writeSpace() >= availableBytes) {
            bytesWasWritten = _client->read(InBuff.getWritePtr(), availableBytes);
        } else {
            bytesWasWritten = _client->read(InBuff.getWritePtr(), InBuff.writeSpace());
        }
        InBuff.bytesWritten(bytesWasWritten);

        byteCounter += bytesWasWritten;
        if (byteCounter == m_contentlength || byteCounter == chunkSize) {
            byteCounter = 0;
            m_f_continue = true;
        }
    }

    // if the buffer is often almost empty issue a warning or try a new connection - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        if (streamDetection(availableBytes))
            return;
    }

    if (InBuff.bufferFilled() > maxFrameSize && !f_stream) { // waiting for buffer filled
        f_stream = true;                                     // ready to play the audio data
        uint16_t filltime = millis() - m_t0;
        if (m_f_Log)
            AUDIO_INFO("stream ready");
        if (m_f_Log)
            AUDIO_INFO("buffer filled in %d ms", filltime);
    }

    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream) {
        static uint8_t cnt = 0;
        cnt++;
        if (cnt == 3) {
            playAudioData();
            cnt = 0;
        } // aac only
    }
    return;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::playAudioData()
{

    if (InBuff.bufferFilled() < InBuff.getMaxBlockSize())
        return; // guard

    int bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.getMaxBlockSize());

    if (bytesDecoded < 0) { // no syncword found or decode error, try next chunk
        log_i("err bytesDecoded %i", bytesDecoded);
        uint8_t next = 200;
        if (InBuff.bufferFilled() < next)
            next = InBuff.bufferFilled();
        InBuff.bytesWasRead(next); // try next chunk
        m_bytesNotDecoded += next;
    } else {
        if (bytesDecoded > 0) {
            InBuff.bytesWasRead(bytesDecoded);
            return;
        }
        if (bytesDecoded == 0)
            return; // syncword at pos0 found
    }

    return;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::parseHttpResponseHeader()
{ // this is the response to a GET / request
    // Serial.printf("aaaaaaaaaaaaaa4:");
    if (getDatamode() != HTTP_RESPONSE_HEADER)
        return false;
    if (_client->available() == 0)
        return false;

    char rhl[512] = {0}; // responseHeaderline
    bool ct_seen = false;
    uint32_t ctime = millis();
    uint32_t timeout = 2500; // ms

    while (true) { // outer while
        uint16_t pos = 0;
        if ((millis() - ctime) > timeout) {
            log_e("timeout");
            goto exit;
        }
        while (_client->available()) {
            uint8_t b = _client->read();
            if (b == '\n') {
                if (!pos) { // empty line received, is the last line of this responseHeader
                    if (ct_seen)
                        goto lastToDo;
                    else
                        goto exit;
                }
                break;
            }
            if (b == '\r')
                rhl[pos] = 0;
            if (b < 0x20)
                continue;
            rhl[pos] = b;
            pos++;
            if (pos == 511) {
                pos = 510;
                continue;
            }
            if (pos == 510) {
                rhl[pos] = '\0';
                if (m_f_Log)
                    log_i("responseHeaderline overflow");
            }
        } // inner while

        if (!pos) {
            vTaskDelay(3);
            continue;
        }

        if (m_f_Log) {
            log_i("httpResponseHeader: %s", rhl);
        }

        int16_t posColon = indexOf(rhl, ":", 0); // lowercase all letters up to the colon
        if (posColon >= 0) {
            for (int i = 0; i < posColon; i++) {
                rhl[i] = toLowerCase(rhl[i]);
            }
        }

        if (startsWith(rhl, "HTTP/")) { // HTTP status error code
            char statusCode[5];
            statusCode[0] = rhl[9];
            statusCode[1] = rhl[10];
            statusCode[2] = rhl[11];
            statusCode[3] = '\0';
            int sc = atoi(statusCode);
            if (sc > 310) { // e.g. HTTP/1.1 301 Moved Permanently
                if (audio_showstreamtitle)
                    audio_showstreamtitle(rhl);
                goto exit;
            }
        }

        else if (startsWith(rhl, "content-type:")) { // content-type: text/html; charset=UTF-8
            // log_i("cT: %s", rhl);
            int idx = indexOf(rhl + 13, ";");
            if (idx > 0)
                rhl[13 + idx] = '\0';
            if (parseContentType(rhl + 13))
                ct_seen = true;
            else
                goto exit;
        }

        else if (startsWith(rhl, "location:")) {
            int pos = indexOf(rhl, "http", 0);
            if (pos >= 0) {
                const char *c_host = (rhl + pos);
                if (strcmp(c_host, m_lastHost) != 0) { // prevent a loop
                    int pos_slash = indexOf(c_host, "/", 9);
                    if (pos_slash > 9) {
                        if (!strncmp(c_host, m_lastHost, pos_slash)) {
                            AUDIO_INFO("redirect to new extension at existing host \"%s\"", c_host);
                            if (m_playlistFormat == FORMAT_M3U8) {
                                strcpy(m_lastHost, c_host);
                                m_f_m3u8data = true;
                            }
                            httpPrint(c_host);
                            while (_client->available())
                                _client->read(); // empty client buffer
                            return true;
                        }
                    }
                    AUDIO_INFO("redirect to new host \"%s\"", c_host);
                    connecttohost(c_host);
                    return true;
                }
            }
        }

        else if (startsWith(rhl, "content-encoding:")) {
            if (indexOf(rhl, "gzip")) {
                AUDIO_INFO("can't extract gzip");
                goto exit;
            }
        }

        else if (startsWith(rhl, "content-disposition:")) {
            int pos1, pos2; // pos3;
            // e.g we have this headerline:  content-disposition: attachment; filename=stream.asx
            // filename is: "stream.asx"
            pos1 = indexOf(rhl, "filename=", 0);
            if (pos1 > 0) {
                pos1 += 9;
                if (rhl[pos1] == '\"')
                    pos1++; // remove '\"' around filename if present
                pos2 = strlen(rhl);
                if (rhl[pos2 - 1] == '\"')
                    rhl[pos2 - 1] = '\0';
            }
            AUDIO_INFO("Filename is %s", rhl + pos1);
        }

        // if(startsWith(rhl, "set-cookie:")         ||
        //         startsWith(rhl, "pragma:")        ||
        //         startsWith(rhl, "expires:")       ||
        //         startsWith(rhl, "cache-control:") ||
        //         startsWith(rhl, "icy-pub:")       ||
        //         startsWith(rhl, "p3p:")           ||
        //         startsWith(rhl, "accept-ranges:") ){
        //     ; // do nothing
        // }

        else if (startsWith(rhl, "connection:")) {
            if (indexOf(rhl, "close", 0) >= 0) {
                ; /* do nothing */
            }
        }

        else if (startsWith(rhl, "icy-genre:")) {
            ; // do nothing Ambient, Rock, etc
        }

