1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
        else if (startsWith(rhl, "icy-br:")) {
            const char *c_bitRate = (rhl + 7);
            int32_t br = atoi(c_bitRate); // Found bitrate tag, read the bitrate in Kbit
            br = br * 1000;
            setBitrate(br);
            sprintf(m_chbuf, "%d", getBitRate());
            if (audio_bitrate)
                audio_bitrate(m_chbuf);
        }

        else if (startsWith(rhl, "icy-metaint:")) {
            const char *c_metaint = (rhl + 12);
            int32_t i_metaint = atoi(c_metaint);
            m_metaint = i_metaint;
            if (m_metaint)
                m_f_metadata = true; // Multimediastream
        }

        else if (startsWith(rhl, "icy-name:")) {
            char *c_icyname = (rhl + 9); // Get station name
            trim(c_icyname);
            if (strlen(c_icyname) > 0) {
                if (!m_f_Log)
                    AUDIO_INFO("icy-name: %s", c_icyname);
                if (audio_showstation)
                    audio_showstation(c_icyname);
            }
        }

        else if (startsWith(rhl, "content-length:")) {
            const char *c_cl = (rhl + 15);
            int32_t i_cl = atoi(c_cl);
            m_contentlength = i_cl;
            m_streamType = ST_WEBFILE; // Stream comes from a fileserver
            if (m_f_Log)
                AUDIO_INFO("content-length: %i", m_contentlength);
        }

        else if (startsWith(rhl, "icy-description:")) {
            const char *c_idesc = (rhl + 16);
            while (c_idesc[0] == ' ')
                c_idesc++;
            latinToUTF8(rhl, sizeof(rhl)); // if already UTF-8 do nothing, otherwise convert to UTF-8
            if (specialIndexOf((uint8_t *)c_idesc, "24bit", strlen(c_idesc)) >= 0) {
                AUDIO_INFO("icy-description: %s has to be 8 or 16", c_idesc);
                stopSong();
            }
            if (audio_icydescription)
                audio_icydescription(c_idesc);
        }

        else if ((startsWith(rhl, "transfer-encoding:"))) {
            if (endsWith(rhl, "chunked") || endsWith(rhl, "Chunked")) { // Station provides chunked transfer
                m_f_chunked = true;
                if (!m_f_Log)
                    AUDIO_INFO("chunked data transfer");
                m_chunkcount = 0; // Expect chunkcount in DATA
            }
        }

        else if (startsWith(rhl, "icy-url:")) {
            char *icyurl = (rhl + 8);
            trim(icyurl);
            if (audio_icyurl)
                audio_icyurl(icyurl);
        }

        else if (startsWith(rhl, "www-authenticate:")) {
            AUDIO_INFO("authentification failed, wrong credentials?");
            goto exit;
        } else {
            ;
        }
    } // outer while

exit: // termination condition
    if (audio_showstation)
        audio_showstation("");
    if (audio_icydescription)
        audio_icydescription("");
    if (audio_icyurl)
        audio_icyurl("");
    m_lastHost[0] = '\0';
    setDatamode(AUDIO_NONE);
    stopSong();
    return false;

lastToDo:
    if (m_codec != CODEC_NONE) {
        setDatamode(AUDIO_DATA); // Expecting data now
        if (!initializeDecoder())
            return false;
        if (m_f_Log) {
            log_i("Switch to DATA, metaint is %d", m_metaint);
        }
        if (m_playlistFormat != FORMAT_M3U8 && audio_lasthost)
            audio_lasthost(m_lastHost);
        m_controlCounter = 0;
        m_f_firstCall = true;
    } else if (m_playlistFormat != FORMAT_NONE) {
        setDatamode(AUDIO_PLAYLISTINIT); // playlist expected
        if (m_f_Log) {
            log_i("now parse playlist");
        }
    } else {
        AUDIO_INFO("unknown content found at: %s", m_lastHost);
        goto exit;
    }
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::initializeDecoder()
{
    uint32_t gfH = 0;
    uint32_t hWM = 0;
    switch (m_codec) {
    case CODEC_MP3:
        if (!MP3Decoder_AllocateBuffers()) {
            AUDIO_INFO("The MP3Decoder could not be initialized");
            goto exit;
        }
        gfH = ESP.getFreeHeap();
        hWM = uxTaskGetStackHighWaterMark(NULL);
        AUDIO_INFO("MP3Decoder has been initialized, free Heap: %u bytes , free stack %u DWORDs", gfH, hWM);
        InBuff.changeMaxBlockSize(m_frameSizeMP3);
        break;
        // case CODEC_AAC:
        //     if (!AACDecoder_IsInit())
        //     {
        //         if (!AACDecoder_AllocateBuffers())
        //         {
        //             AUDIO_INFO("The AACDecoder could not be initialized");
        //             goto exit;
        //         }
        //         gfH = ESP.getFreeHeap();
        //         hWM = uxTaskGetStackHighWaterMark(NULL);
        //         AUDIO_INFO("AACDecoder has been initialized, free Heap: %u bytes , free stack %u DWORDs", gfH, hWM);
        //         InBuff.changeMaxBlockSize(m_frameSizeAAC);
        //     }
        //     break;
        // case CODEC_M4A:
        //     if (!AACDecoder_IsInit())
        //     {
        //         if (!AACDecoder_AllocateBuffers())
        //         {
        //             AUDIO_INFO("The AACDecoder could not be initialized");
        //             goto exit;
        //         }
        //         gfH = ESP.getFreeHeap();
        //         hWM = uxTaskGetStackHighWaterMark(NULL);
        //         AUDIO_INFO("AACDecoder has been initialized, free Heap: %u bytes , free stack %u DWORDs", gfH, hWM);
        //         InBuff.changeMaxBlockSize(m_frameSizeAAC);
        //     }
        //     break;
        // case CODEC_FLAC:
        //     if (!psramFound())
        //     {
        //         AUDIO_INFO("FLAC works only with PSRAM!");
        //         goto exit;
        //     }
        //     // if (!FLACDecoder_AllocateBuffers())
        //     // {
        //     //     AUDIO_INFO("The FLACDecoder could not be initialized");
        //     //     goto exit;
        //     // }
        //     gfH = ESP.getFreeHeap();
        //     hWM = uxTaskGetStackHighWaterMark(NULL);
        //     InBuff.changeMaxBlockSize(m_frameSizeFLAC);
        //     AUDIO_INFO("FLACDecoder has been initialized, free Heap: %u bytes , free stack %u DWORDs", gfH, hWM);
        //     break;
        // case CODEC_OPUS:
        //     if (!OPUSDecoder_AllocateBuffers())
        //     {
        //         AUDIO_INFO("The OPUSDecoder could not be initialized");
        //         goto exit;
        //     }
        //     gfH = ESP.getFreeHeap();
        //     hWM = uxTaskGetStackHighWaterMark(NULL);
        //     AUDIO_INFO("OPUSDecoder has been initialized, free Heap: %u bytes , free stack %u DWORDs", gfH, hWM);
        //     InBuff.changeMaxBlockSize(m_frameSizeOPUS);
        //     break;
        // case CODEC_VORBIS:
        //     if (!psramFound())
        //     {
        //         AUDIO_INFO("VORBIS works only with PSRAM!");
        //         goto exit;
        //     }
        //     if (!VORBISDecoder_AllocateBuffers())
        //     {
        //         AUDIO_INFO("The VORBISDecoder could not be initialized");
        //         goto exit;
        //     }
        gfH = ESP.getFreeHeap();
        hWM = uxTaskGetStackHighWaterMark(NULL);
        AUDIO_INFO("VORBISDecoder has been initialized, free Heap: %u bytes,  free stack %u DWORDs", gfH, hWM);
        InBuff.changeMaxBlockSize(m_frameSizeVORBIS);
        break;
    case CODEC_WAV:
        InBuff.changeMaxBlockSize(m_frameSizeWav);
        break;
    case CODEC_OGG: // the decoder will be determined later (vorbis, flac, opus?)
        break;
    default:
        goto exit;
        break;
    }
    return true;

