1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    idx1 = indexOf(ml, "StreamTitle=", 0); // Streamtitle found
    if (idx1 >= 0) {
        if (indexOf(ml, "xml version=", 12) > 0) {

            /* e.g. xmlStreamTitle
            StreamTitle='<?xml version="1.0" encoding="utf-8"?><RadioInfo><Table><DB_ALBUM_ID>37364</DB_ALBUM_ID>
            <DB_ALBUM_IMAGE>00000037364.jpg</DB_ALBUM_IMAGE><DB_ALBUM_NAME>Boyfriend</DB_ALBUM_NAME>
            <DB_ALBUM_TYPE>Single</DB_ALBUM_TYPE><DB_DALET_ARTIST_NAME>DOVE CAMERON</DB_DALET_ARTIST_NAME>
            <DB_DALET_ITEM_CODE>CD4161</DB_DALET_ITEM_CODE><DB_DALET_TITLE_NAME>BOYFRIEND</DB_DALET_TITLE_NAME>
            <DB_FK_SITE_ID>2</DB_FK_SITE_ID><DB_IS_MUSIC>1</DB_IS_MUSIC><DB_LEAD_ARTIST_ID>26303</DB_LEAD_ARTIST_ID>
            <DB_LEAD_ARTIST_NAME>Dove Cameron</DB_LEAD_ARTIST_NAME><DB_RADIO_IMAGE>cidadefm.jpg</DB_RADIO_IMAGE>
            <DB_RADIO_NAME>Cidade</DB_RADIO_NAME><DB_SONG_ID>120126</DB_SONG_ID><DB_SONG_LYRIC>60981</DB_SONG_LYRIC>
            <DB_SONG_NAME>Boyfriend</DB_SONG_NAME></Table><AnimadorInfo><TITLE>Cidade</TITLE>
            <START_TIME_UTC>2022-11-15T22:00:00+00:00</START_TIME_UTC><END_TIME_UTC>2022-11-16T06:59:59+00:00
            </END_TIME_UTC><SHOW_NAME>Cidade</SHOW_NAME><SHOW_HOURS>22h às 07h</SHOW_HOURS><SHOW_PANEL>0</SHOW_PANEL>
            </AnimadorInfo></RadioInfo>';StreamUrl='';
            */

            idx4 = indexOf(ml, "<DB_DALET_TITLE_NAME>");
            idx5 = indexOf(ml, "</DB_DALET_TITLE_NAME>");

            idx6 = indexOf(ml, "<DB_LEAD_ARTIST_NAME>");
            idx7 = indexOf(ml, "</DB_LEAD_ARTIST_NAME>");

            if (idx4 == -1 || idx5 == -1)
                return;
            idx4 += 21; // <DB_DALET_TITLE_NAME>
            titleLen = idx5 - idx4;

            if (idx6 != -1 && idx7 != -1) {
                idx6 += 21; // <DB_LEAD_ARTIST_NAME>
                artistLen = idx7 - idx6;
            }

            char *title = NULL;
            title = (char *)malloc(titleLen + artistLen + 4);
            memcpy(title, ml + idx4, titleLen);
            title[titleLen] = '\0';

            char *artist = NULL;
            if (artistLen) {
                memcpy(title + titleLen, " - ", 3);
                memcpy(title + titleLen + 3, ml + idx6, artistLen);
                title[titleLen + 3 + artistLen] = '\0';
            }

            if (title)
                if (audio_showstreamtitle)
                    audio_showstreamtitle(title);
            if (title) {
                free(title);
                title = NULL;
            }
            if (artist) {
                free(artist);
                artist = NULL;
            }
            return;
        }

        idx2 = indexOf(ml, ";", idx1);
        char *sTit;
        if (idx2 >= 0) {
            sTit = strndup(ml + idx1, idx2 + 1);
            sTit[idx2] = '\0';
        } else
            sTit = strdup(ml);

        while (i < strlen(sTit)) {
            hash += sTit[i] * i + 1;
            i++;
        }

        if (m_streamTitleHash != hash) {
            m_streamTitleHash = hash;
            AUDIO_INFO("%s", sTit);
            uint8_t pos = 12; // remove "StreamTitle="
            if (sTit[pos] == '\'')
                pos++; // remove leading  \'
            if (sTit[strlen(sTit) - 1] == '\'')
                sTit[strlen(sTit) - 1] = '\0'; // remove trailing \'
            if (audio_showstreamtitle)
                audio_showstreamtitle(sTit + pos);
        }
        if (sTit) {
            free(sTit);
            sTit = NULL;
        }
    }

    idx1 = indexOf(ml, "StreamUrl=", 0);
    idx2 = indexOf(ml, ";", idx1);
    if (idx1 >= 0 && idx2 > idx1) { // StreamURL found
        uint16_t len = idx2 - idx1;
        char *sUrl;
        sUrl = strndup(ml + idx1, len + 1);
        sUrl[len] = '\0';

        while (i < strlen(sUrl)) {
            hash += sUrl[i] * i + 1;
            i++;
        }
        if (m_streamTitleHash != hash) {
            m_streamTitleHash = hash;
            AUDIO_INFO("%s", sUrl);
        }
        if (sUrl) {
            free(sUrl);
            sUrl = NULL;
        }
    }

    idx1 = indexOf(ml, "adw_ad=", 0);
    if (idx1 >= 0) { // Advertisement found
        idx1 = indexOf(ml, "durationMilliseconds=", 0);
        idx2 = indexOf(ml, ";", idx1);
        if (idx1 >= 0 && idx2 > idx1) {
            uint16_t len = idx2 - idx1;
            char *sAdv;
            sAdv = strndup(ml + idx1, len + 1);
            sAdv[len] = '\0';
            AUDIO_INFO("%s", sAdv);
            uint8_t pos = 21; // remove "StreamTitle="
            if (sAdv[pos] == '\'')
                pos++; // remove leading  \'
            if (sAdv[strlen(sAdv) - 1] == '\'')
                sAdv[strlen(sAdv) - 1] = '\0'; // remove trailing \'
            if (audio_commercial)
                audio_commercial(sAdv + pos);
            if (sAdv) {
                free(sAdv);
                sAdv = NULL;
            }
        }
    }
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::showCodecParams()
{
    // print Codec Parameter (mp3, aac) in audio_info()

    AUDIO_INFO("Channels: %i", getChannels());
    AUDIO_INFO("SampleRate: %i", getSampleRate());
    AUDIO_INFO("BitsPerSample: %i", getBitsPerSample());
    if (getBitRate()) {
        AUDIO_INFO("BitRate: %i", getBitRate());
    } else {
        AUDIO_INFO("BitRate: N/A");
    }

    // if (m_codec == CODEC_AAC)
    // {
    //     uint8_t answ = AACGetFormat();
    //     if (answ < 4)
    //     {
    //         const char hf[4][8] = {"unknown", "ADTS", "ADIF", "RAW"};
    //         AUDIO_INFO("AAC HeaderFormat: %s", hf[answ])
    //     }
    //     if (answ == 1)
    //     { // ADTS Header
    //         uint8_t aacId = AACGetID();
    //         uint8_t aacPr = AACGetProfile();
    //         if (aacId < 2 && aacPr < 4)
    //         {
    //             const char co[2][7] = {"MPEG-4", "MPEG-2"};
    //             const char pr[4][23] = {"Main", "LowComplexity", "Scalable Sampling Rate", "reserved"};
    //             AUDIO_INFO("AAC Codec: %s %s", co[aacId], pr[answ]);
    //         }
    //     }
    // }
}
//---------------------------------------------------------------------------------------------------------------------
int AudioHelpr::findNextSync(uint8_t *data, size_t len)
{
    // Mp3 and aac audio data are divided into frames. At the beginning of each frame there is a sync word.
    // The sync word is 0xFFF. This is followed by information about the structure of the frame.
    // Wav files have no frames
    // Return: 0 the synchronous word was found at position 0
    //         > 0 is the offset to the next sync word
    //         -1 the sync word was not found within the block with the length len

    int nextSync;
    static uint32_t swnf = 0;
    if (m_codec == CODEC_WAV) {
        m_f_playing = true;
        nextSync = 0;
    }
    if (m_codec == CODEC_MP3) {
        nextSync = MP3FindSyncWord(data, len);
    }
    // if (m_codec == CODEC_AAC)
    // {
    //     nextSync = AACFindSyncWord(data, len);
    // }
    // if (m_codec == CODEC_M4A)
    // {
    //     AACSetRawBlockParams(0, 2, 44100, 1);
    //     m_f_playing = true;
    //     nextSync = 0;
    // }
    // if (m_codec == CODEC_FLAC)
    // {
    //     FLACSetRawBlockParams(m_flacNumChannels, m_flacSampleRate,
    //                           m_flacBitsPerSample, m_flacTotalSamplesInStream, m_audioDataSize);
    //     nextSync = FLACFindSyncWord(data, len);
    // }
    // if (m_codec == CODEC_OPUS)
    // {
    //     nextSync = OPUSFindSyncWord(data, len);
    //     if (nextSync == -1)
    //         return len; // OggS not found, search next block
    // }
    // if (m_codec == CODEC_VORBIS)
    // {
    //     nextSync = VORBISFindSyncWord(data, len);
    //     if (nextSync == -1)
    //         return len; // OggS not found, search next block
    // }
    if (nextSync == -1) {
        if (audio_info && swnf == 0)
            audio_info("syncword not found");
        else {
            swnf++; // syncword not found counter, can be multimediadata
        }
    }
    if (nextSync == 0) {
        if (audio_info && swnf > 0) {
            sprintf(m_chbuf, "syncword not found %i times", swnf);
            audio_info(m_chbuf);
            swnf = 0;
        } else {
            if (audio_info)
                audio_info("syncword found at pos 0");
        }
    }
    if (nextSync > 0) {
        AUDIO_INFO("syncword found at pos %i", nextSync);
    }
    return nextSync;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setDecoderItems()
{
    if (m_codec == CODEC_MP3) {
        setChannels(MP3GetChannels());
        setSampleRate(MP3GetSampRate());
        setBitsPerSample(MP3GetBitsPerSample());
        setBitrate(MP3GetBitrate());
    }
    // if (m_codec == CODEC_AAC || m_codec == CODEC_M4A)
    // {
    //     setChannels(AACGetChannels());
    //     setSampleRate(AACGetSampRate());
    //     setBitsPerSample(AACGetBitsPerSample());
    //     setBitrate(AACGetBitrate());
    // }
    // if (m_codec == CODEC_FLAC)
    // {
    //     setChannels(FLACGetChannels());
    //     setSampleRate(FLACGetSampRate());
    //     setBitsPerSample(FLACGetBitsPerSample());
    //     setBitrate(FLACGetBitRate());
    // }
    // if (m_codec == CODEC_OPUS)
    // {
    //     setChannels(OPUSGetChannels());
    //     setSampleRate(OPUSGetSampRate());
    //     setBitsPerSample(OPUSGetBitsPerSample());
    //     setBitrate(OPUSGetBitRate());
    // }
    // if (m_codec == CODEC_VORBIS)
    // {
    //     setChannels(VORBISGetChannels());
    //     setSampleRate(VORBISGetSampRate());
    //     setBitsPerSample(VORBISGetBitsPerSample());
    //     setBitrate(VORBISGetBitRate());
    // }
    if (getBitsPerSample() != 8 && getBitsPerSample() != 16) {
        AUDIO_INFO("Bits per sample must be 8 or 16, found %i", getBitsPerSample());
        stopSong();
    }
    if (getChannels() != 1 && getChannels() != 2) {
        AUDIO_INFO("Num of channels must be 1 or 2, found %i", getChannels());
        stopSong();
    }
    showCodecParams();
}
//---------------------------------------------------------------------------------------------------------------------
int AudioHelpr::sendBytes(uint8_t *data, size_t len)
{
    int bytesLeft;
    static bool f_setDecodeParamsOnce = true;
    int nextSync = 0;
    if (!m_f_playing) {
        f_setDecodeParamsOnce = true;
        nextSync = findNextSync(data, len);
        if (nextSync == 0) {
            m_f_playing = true;
        }
        return nextSync;
    }
    // m_f_playing is true at this pos
    bytesLeft = len;
    m_decodeError = 0;
    int bytesDecoded = 0;

