1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    switch (m_codec) {
    case CODEC_WAV:
        memmove(m_outBuff, data, len); // copy len data in outbuff and set validsamples and bytesdecoded=len
        if (getBitsPerSample() == 16)
            m_validSamples = len / (2 * getChannels());
        if (getBitsPerSample() == 8)
            m_validSamples = len / 2;
        bytesLeft = 0;
        break;
    case CODEC_MP3:
        m_decodeError = MP3Decode(data, &bytesLeft, m_outBuff, 0);
        break;
    // case CODEC_AAC:
    //     m_decodeError = AACDecode(data, &bytesLeft, m_outBuff);
    //     break;
    // case CODEC_M4A:
    //     m_decodeError = AACDecode(data, &bytesLeft, m_outBuff);
    //     break;
    // case CODEC_FLAC:
    //     m_decodeError = FLACDecode(data, &bytesLeft, m_outBuff);
    //     break;
    // case CODEC_OPUS:
    //     m_decodeError = OPUSDecode(data, &bytesLeft, m_outBuff);
    //     break;
    // case CODEC_VORBIS:
    //     m_decodeError = VORBISDecode(data, &bytesLeft, m_outBuff);
    //     break;
    default: {
        log_e("no valid codec found codec = %d", m_codec);
        stopSong();
    }
    }

    // m_decodeError - possible values are:
    //                   0: okay, no error
    //                 100: the decoder needs more data
    //                 < 0: there has been an error

    if (m_decodeError < 0) { // Error, skip the frame...
        i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);
        if (!getChannels() && m_codec == CODEC_MP3 && (m_decodeError == -2)) {
            ; // at the beginning this doesn't have to be a mistake, suppress errorcode MAINDATA_UNDERFLOW
        } else {
            printDecodeError(m_decodeError);
            m_f_playing = false; // seek for new syncword
            // if (m_codec == CODEC_FLAC)
            // {
            //     if (m_decodeError == ERR_FLAC_BITS_PER_SAMPLE_TOO_BIG)
            //         stopSong();
            //     if (m_decodeError == ERR_FLAC_RESERVED_CHANNEL_ASSIGNMENT)
            //         stopSong();
            // }
        }
        return 1; // skip one byte and seek for the next sync word
    }
    bytesDecoded = len - bytesLeft;

    if (bytesDecoded == 0 && m_decodeError == 0) { // unlikely framesize
        if (audio_info)
            audio_info("framesize is 0, start decoding again");
        m_f_playing = false; // seek for new syncword
        // we're here because there was a wrong sync word so skip one byte and seek for the next
        return 1;
    }
    // status: bytesDecoded > 0 and m_decodeError >= 0
    {
        if (m_codec == CODEC_MP3) {
            m_validSamples = MP3GetOutputSamps() / getChannels();
        }
        // if ((m_codec == CODEC_AAC) || (m_codec == CODEC_M4A))
        // {
        //     m_validSamples = AACGetOutputSamps() / getChannels();
        // }
        // if (m_codec == CODEC_FLAC)
        // {
        //     const uint8_t FLAC_PARSE_OGG_DONE = 100;
        //     if (m_decodeError == FLAC_PARSE_OGG_DONE)
        //         return bytesDecoded; // nothing to play
        //     m_validSamples = FLACGetOutputSamps() / getChannels();
        //     char *st = FLACgetStreamTitle();
        //     if (st)
        //     {
        //         AUDIO_INFO(st);
        //         if (audio_showstreamtitle)
        //             audio_showstreamtitle(st);
        //     }
        // }
        // if (m_codec == CODEC_OPUS)
        // {
        //     const uint8_t OPUS_PARSE_OGG_DONE = 100;
        //     if (m_decodeError == OPUS_PARSE_OGG_DONE)
        //         return bytesDecoded; // nothing to play
        //     m_validSamples = OPUSGetOutputSamps();
        //     char *st = OPUSgetStreamTitle();
        //     if (st)
        //     {
        //         AUDIO_INFO(st);
        //         if (audio_showstreamtitle)
        //             audio_showstreamtitle(st);
        //     }
        // }
        // if (m_codec == CODEC_VORBIS)
        // {
        //     const uint8_t VORBIS_PARSE_OGG_DONE = 100;
        //     if (m_decodeError == VORBIS_PARSE_OGG_DONE)
        //         return bytesDecoded; // nothing to play
        //     m_validSamples = VORBISGetOutputSamps();
        //     char *st = VORBISgetStreamTitle();
        //     if (st)
        //     {
        //         AUDIO_INFO(st);
        //         if (audio_showstreamtitle)
        //             audio_showstreamtitle(st);
        //     }
        // }
        if (f_setDecodeParamsOnce) {
            f_setDecodeParamsOnce = false;
            setDecoderItems();
            m_PlayingStartTime = millis();
        }
    }
    compute_audioCurrentTime(bytesDecoded);

    if (audio_process_extern) {
        bool continueI2S = false;
        audio_process_extern(m_outBuff, m_validSamples, &continueI2S);
        if (!continueI2S) {
            return bytesDecoded;
        }
    }
    while (m_validSamples) {
        playChunk();
    }
    return bytesDecoded;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::compute_audioCurrentTime(int bd)
{
    static uint16_t loop_counter = 0;
    static int old_bitrate = 0;
    static uint64_t sum_bitrate = 0;
    static boolean f_CBR = true; // constant bitrate

    if (m_codec == CODEC_MP3) {
        setBitrate(MP3GetBitrate());
    } // if not CBR, bitrate can be changed
    // if (m_codec == CODEC_M4A)
    // {
    //     setBitrate(AACGetBitrate());
    // } // if not CBR, bitrate can be changed
    // if (m_codec == CODEC_AAC)
    // {
    //     setBitrate(AACGetBitrate());
    // } // if not CBR, bitrate can be changed
    // if (m_codec == CODEC_FLAC)
    // {
    //     setBitrate(FLACGetBitRate());
    // } // if not CBR, bitrate can be changed
    if (!getBitRate())
        return;

    //- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_avr_bitrate == 0) { // first time
        loop_counter = 0;
        old_bitrate = 0;
        sum_bitrate = 0;
        f_CBR = true;
        m_avr_bitrate = getBitRate();
        old_bitrate = getBitRate();
    }
    if (!m_avr_bitrate)
        return;
    //- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

