1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (loop_counter < 1000)
        loop_counter++;

    if ((old_bitrate != getBitRate()) && f_CBR) {
        if (audio_info)
            audio_info("VBR recognized, audioFileDuration is estimated");
        f_CBR = false; // variable bitrate
    }
    old_bitrate = getBitRate();

    if (!f_CBR) {
        if (loop_counter > 20 && loop_counter < 200) {
            // if VBR: m_avr_bitrate is average of the first values of m_bitrate
            sum_bitrate += getBitRate();
            m_avr_bitrate = sum_bitrate / (loop_counter - 20);
            if (loop_counter == 199 && m_resumeFilePos >= 0) {
                m_audioCurrentTime = ((getFilePos() - m_audioDataStart - inBufferFilled()) / m_avr_bitrate) * 8; // #293
            }
        }
    } else {
        if (loop_counter == 2) {
            m_avr_bitrate = getBitRate();
            if (m_resumeFilePos >= 0) {                                                                          // if connecttoFS() is called with resumeFilePos != 0
                m_audioCurrentTime = ((getFilePos() - m_audioDataStart - inBufferFilled()) / m_avr_bitrate) * 8; // #293
            }
        }
    }
    m_audioCurrentTime += ((float)bd / m_avr_bitrate) * 8;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::printDecodeError(int r)
{
    const char *e;

    if (m_codec == CODEC_MP3) {
        switch (r) {
        case ERR_MP3_NONE:
            e = "NONE";
            break;
        case ERR_MP3_INDATA_UNDERFLOW:
            e = "INDATA_UNDERFLOW";
            break;
        case ERR_MP3_MAINDATA_UNDERFLOW:
            e = "MAINDATA_UNDERFLOW";
            break;
        case ERR_MP3_FREE_BITRATE_SYNC:
            e = "FREE_BITRATE_SYNC";
            break;
        case ERR_MP3_OUT_OF_MEMORY:
            e = "OUT_OF_MEMORY";
            break;
        case ERR_MP3_NULL_POINTER:
            e = "NULL_POINTER";
            break;
        case ERR_MP3_INVALID_FRAMEHEADER:
            e = "INVALID_FRAMEHEADER";
            break;
        case ERR_MP3_INVALID_SIDEINFO:
            e = "INVALID_SIDEINFO";
            break;
        case ERR_MP3_INVALID_SCALEFACT:
            e = "INVALID_SCALEFACT";
            break;
        case ERR_MP3_INVALID_HUFFCODES:
            e = "INVALID_HUFFCODES";
            break;
        case ERR_MP3_INVALID_DEQUANTIZE:
            e = "INVALID_DEQUANTIZE";
            break;
        case ERR_MP3_INVALID_IMDCT:
            e = "INVALID_IMDCT";
            break;
        case ERR_MP3_INVALID_SUBBAND:
            e = "INVALID_SUBBAND";
            break;
        default:
            e = "ERR_UNKNOWN";
        }
        AUDIO_INFO("MP3 decode error %d : %s", r, e);
    }
    // if (m_codec == CODEC_AAC)
    // {
    //     switch (r)
    //     {
    //     // case ERR_AAC_NONE:
    //     //     e = "NONE";
    //     //     break;
    //     // case ERR_AAC_INDATA_UNDERFLOW:
    //     //     e = "INDATA_UNDERFLOW";
    //     //     break;
    //     // case ERR_AAC_NULL_POINTER:
    //     //     e = "NULL_POINTER";
    //     //     break;
    //     // case ERR_AAC_INVALID_ADTS_HEADER:
    //     //     e = "INVALID_ADTS_HEADER";
    //     //     break;
    //     // case ERR_AAC_INVALID_ADIF_HEADER:
    //     //     e = "INVALID_ADIF_HEADER";
    //     //     break;
    //     // case ERR_AAC_INVALID_FRAME:
    //     //     e = "INVALID_FRAME";
    //     //     break;
    //     // case ERR_AAC_MPEG4_UNSUPPORTED:
    //     //     e = "MPEG4_UNSUPPORTED";
    //     //     break;
    //     // case ERR_AAC_CHANNEL_MAP:
    //     //     e = "CHANNEL_MAP";
    //     //     break;
    //     // case ERR_AAC_SYNTAX_ELEMENT:
    //     //     e = "SYNTAX_ELEMENT";
    //     //     break;
    //     // case ERR_AAC_DEQUANT:
    //     //     e = "DEQUANT";
    //     //     break;
    //     // case ERR_AAC_STEREO_PROCESS:
    //     //     e = "STEREO_PROCESS";
    //     //     break;
    //     // case ERR_AAC_PNS:
    //     //     e = "PNS";
    //     //     break;
    //     // case ERR_AAC_SHORT_BLOCK_DEINT:
    //     //     e = "SHORT_BLOCK_DEINT";
    //     //     break;
    //     // case ERR_AAC_TNS:
    //     //     e = "TNS";
    //     //     break;
    //     // case ERR_AAC_IMDCT:
    //     //     e = "IMDCT";
    //     //     break;
    //     // case ERR_AAC_SBR_INIT:
    //     //     e = "SBR_INIT";
    //     //     break;
    //     // case ERR_AAC_SBR_BITSTREAM:
    //     //     e = "SBR_BITSTREAM";
    //     //     break;
    //     // case ERR_AAC_SBR_DATA:
    //     //     e = "SBR_DATA";
    //     //     break;
    //     // case ERR_AAC_SBR_PCM_FORMAT:
    //     //     e = "SBR_PCM_FORMAT";
    //     //     break;
    //     // case ERR_AAC_SBR_NCHANS_TOO_HIGH:
    //     //     e = "SBR_NCHANS_TOO_HIGH";
    //     //     break;
    //     // case ERR_AAC_SBR_SINGLERATE_UNSUPPORTED:
    //     //     e = "BR_SINGLERATE_UNSUPPORTED";
    //     //     break;
    //     // case ERR_AAC_NCHANS_TOO_HIGH:
    //     //     e = "NCHANS_TOO_HIGH";
    //     //     break;
    //     // case ERR_AAC_RAWBLOCK_PARAMS:
    //     //     e = "RAWBLOCK_PARAMS";
    //     //     break;
    //     default:
    //         e = "ERR_UNKNOWN";
    //     }
    //     AUDIO_INFO("AAC decode error %d : %s", r, e);
    // }
    // if (m_codec == CODEC_FLAC)
    // {
    //     switch (r)
    //     {
    //     case ERR_FLAC_NONE:
    //         e = "NONE";
    //         break;
    //     case ERR_FLAC_BLOCKSIZE_TOO_BIG:
    //         e = "BLOCKSIZE TOO BIG";
    //         break;
    //     case ERR_FLAC_RESERVED_BLOCKSIZE_UNSUPPORTED:
    //         e = "Reserved Blocksize unsupported";
    //         break;
    //     case ERR_FLAC_SYNC_CODE_NOT_FOUND:
    //         e = "SYNC CODE NOT FOUND";
    //         break;
    //     case ERR_FLAC_UNKNOWN_CHANNEL_ASSIGNMENT:
    //         e = "UNKNOWN CHANNEL ASSIGNMENT";
    //         break;
    //     case ERR_FLAC_RESERVED_CHANNEL_ASSIGNMENT:
    //         e = "RESERVED CHANNEL ASSIGNMENT";
    //         break;
    //     case ERR_FLAC_RESERVED_SUB_TYPE:
    //         e = "RESERVED SUB TYPE";
    //         break;
    //     case ERR_FLAC_PREORDER_TOO_BIG:
    //         e = "PREORDER TOO BIG";
    //         break;
    //     case ERR_FLAC_RESERVED_RESIDUAL_CODING:
    //         e = "RESERVED RESIDUAL CODING";
    //         break;
    //     case ERR_FLAC_WRONG_RICE_PARTITION_NR:
    //         e = "WRONG RICE PARTITION NR";
    //         break;
    //     case ERR_FLAC_BITS_PER_SAMPLE_TOO_BIG:
    //         e = "BITS PER SAMPLE > 16";
    //         break;
    //     case ERR_FLAG_BITS_PER_SAMPLE_UNKNOWN:
    //         e = "BITS PER SAMPLE UNKNOWN";
    //         break;
    //     default:
    //         e = "ERR_UNKNOWN";
    //     }
    //     AUDIO_INFO("FLAC decode error %d : %s", r, e);
    // }
    // if (m_codec == CODEC_OPUS)
    // {
    //     switch (r)
    //     {
    //     case ERR_OPUS_NONE:
    //         e = "NONE";
    //         break;
    //     case ERR_OPUS_CHANNELS_OUT_OF_RANGE:
    //         e = "UNKNOWN CHANNEL ASSIGNMENT";
    //         break;
    //     case ERR_OPUS_INVALID_SAMPLERATE:
    //         e = "SAMPLERATE IS NOT 48000Hz";
    //         break;
    //     case ERR_OPUS_EXTRA_CHANNELS_UNSUPPORTED:
    //         e = "EXTRA CHANNELS UNSUPPORTED";
    //         break;
    //     case ERR_OPUS_SILK_MODE_UNSUPPORTED:
    //         e = "SILK MODE UNSUPPORTED";
    //         break;
    //     case ERR_OPUS_HYBRID_MODE_UNSUPPORTED:
    //         e = "HYBRID MODE UMSUPPORTED";
    //         break;
    //     case ERR_OPUS_CELT_BAD_ARG:
    //         e = "CELT_DECODER_BAD_ARG";
    //         break;
    //     case ERR_OPUS_CELT_INTERNAL_ERROR:
    //         e = "CELT DECODER INTERNAL ERROR";
    //         break;
    //     case ERR_OPUS_CELT_UNIMPLEMENTED:
    //         e = "CELT DECODER UNIMPLEMENTED ARG";
    //         break;
    //     case ERR_OPUS_CELT_ALLOC_FAIL:
    //         e = "CELT DECODER INIT ALLOC FAIL";
    //         break;
    //     case ERR_OPUS_CELT_UNKNOWN_REQUEST:
    //         e = "CELT_UNKNOWN_REQUEST FAIL";
    //         break;
    //     case ERR_OPUS_CELT_GET_MODE_REQUEST:
    //         e = "CELT_GET_MODE_REQUEST FAIL";
    //         break;
    //     case ERR_OPUS_CELT_CLEAR_REQUEST:
    //         e = "CELT_CLEAR_REAUEST_FAIL";
    //         break;
    //     case ERR_OPUS_CELT_SET_CHANNELS:
    //         e = "CELT_SET_CHANNELS_FAIL";
    //         break;
    //     case ERR_OPUS_CELT_END_BAND:
    //         e = "CELT_END_BAND_REQUEST_FAIL";
    //         break;
    //     case ERR_CELT_OPUS_INTERNAL_ERROR:
    //         e = "CELT_INTERNAL_ERROR";
    //         break;
    //     default:
    //         e = "ERR_UNKNOWN";
    //     }
    //     AUDIO_INFO("OPUS decode error %d : %s", r, e);
    // }
    // if (m_codec == CODEC_VORBIS)
    // {
    //     switch (r)
    //     {
    //     case ERR_VORBIS_NONE:
    //         e = "NONE";
    //         break;
    //     case ERR_VORBIS_CHANNELS_OUT_OF_RANGE:
    //         e = "CHANNELS OUT OF RANGE";
    //         break;
    //     case ERR_VORBIS_INVALID_SAMPLERATE:
    //         e = "INVALID SAMPLERATE";
    //         break;
    //     case ERR_VORBIS_EXTRA_CHANNELS_UNSUPPORTED:
    //         e = "EXTRA CHANNELS UNSUPPORTED";
    //         break;
    //     case ERR_VORBIS_DECODER_ASYNC:
    //         e = "DECODER ASYNC";
    //         break;
    //     case ERR_VORBIS_OGG_SYNC_NOT_FOUND:
    //         e = "SYNC NOT FOUND";
    //         break;
    //     case ERR_VORBIS_BAD_HEADER:
    //         e = "BAD HEADER";
    //         break;
    //     case ERR_VORBIS_NOT_AUDIO:
    //         e = "NOT AUDIO";
    //         break;
    //     case ERR_VORBIS_BAD_PACKET:
    //         e = "BAD PACKET";
    //         break;
    //     default:
    //         e = "ERR_UNKNOWN";
    //     }
    //     AUDIO_INFO("VORBIS decode error %d : %s", r, e);
    // }
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t DIN, int8_t MCK)
{

    m_pin_config.bck_io_num = BCLK;
    m_pin_config.ws_io_num = LRC; //  wclk
    m_pin_config.data_out_num = DOUT;
    m_pin_config.data_in_num = DIN;
#if (ESP_IDF_VERSION_MAJOR >= 4 && ESP_IDF_VERSION_MINOR >= 4)
    m_pin_config.mck_io_num = MCK;
#endif

    const esp_err_t result = i2s_set_pin((i2s_port_t)m_i2s_num, &m_pin_config);
    return (result == ESP_OK);
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getFileSize()
{
    if (!audiofile)
        return 0;
    return audiofile.size();
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getFilePos()
{
    if (!audiofile)
        return 0;
    return audiofile.position();
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getAudioDataStartPos()
{
    if (!audiofile)
        return 0;
    return m_audioDataStart;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getAudioFileDuration()
{
    if (getDatamode() == AUDIO_LOCALFILE) {
        if (!audiofile)
            return 0;
    }
    if (m_streamType == ST_WEBFILE) {
        if (!m_contentlength)
            return 0;
    }

