1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    if (m_avr_bitrate && m_codec == CODEC_MP3)
        m_audioFileDuration = 8 * (m_audioDataSize / m_avr_bitrate); // #289
    else if (m_avr_bitrate && m_codec == CODEC_WAV)
        m_audioFileDuration = 8 * (m_audioDataSize / m_avr_bitrate);
    // else if (m_avr_bitrate && m_codec == CODEC_M4A)
    //     m_audioFileDuration = 8 * (m_audioDataSize / m_avr_bitrate);
    // else if (m_avr_bitrate && m_codec == CODEC_AAC)
    //     m_audioFileDuration = 8 * (m_audioDataSize / m_avr_bitrate);
    // else if (m_codec == CODEC_FLAC)
    //     m_audioFileDuration = FLACGetAudioFileDuration();
    else
        return 0;
    return m_audioFileDuration;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getAudioCurrentTime()
{ // return current time in seconds
    return (uint32_t)m_audioCurrentTime;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setAudioPlayPosition(uint16_t sec)
{
    if (m_codec == CODEC_OPUS)
        return false; // not impl. yet
    if (m_codec == CODEC_VORBIS)
        return false; // not impl. yet
    // Jump to an absolute position in time within an audio file
    // e.g. setAudioPlayPosition(300) sets the pointer at pos 5 min
    if (sec > getAudioFileDuration())
        sec = getAudioFileDuration();
    uint32_t filepos = m_audioDataStart + (m_avr_bitrate * sec / 8);
    return setFilePos(filepos);
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setVolumeSteps(uint8_t steps)
{
    m_vol_steps = steps;
    if (steps < 1)
        m_vol_steps = 64; /* avoid div-by-zero :-) */
}
//---------------------------------------------------------------------------------------------------------------------
uint8_t AudioHelpr::maxVolume()
{
    return m_vol_steps;
};
//---------------------------------------------------------------------------------------------------------------------
uint32_t AudioHelpr::getTotalPlayingTime()
{
    // Is set to zero by a connectToXXX() and starts as soon as the first audio data is available,
    // the time counting is not interrupted by a 'pause / resume' and is not reset by a fileloop
    return millis() - m_PlayingStartTime;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setTimeOffset(int sec)
{
    if (m_codec == CODEC_OPUS)
        return false; // not impl. yet
    if (m_codec == CODEC_VORBIS)
        return false; // not impl. yet
    // fast forward or rewind the current position in seconds
    // audiosource must be a mp3, aac or wav file

    if (!audiofile || !m_avr_bitrate)
        return false;

    uint32_t oneSec = m_avr_bitrate / 8;                 // bytes decoded in one sec
    int32_t offset = oneSec * sec;                       // bytes to be wind/rewind
    uint32_t startAB = m_audioDataStart;                 // audioblock begin
    uint32_t endAB = m_audioDataStart + m_audioDataSize; // audioblock end

    if (m_codec == CODEC_MP3 || m_codec == CODEC_AAC || m_codec == CODEC_WAV || m_codec == CODEC_FLAC) {
        int32_t pos = getFilePos() - inBufferFilled();
        pos += offset;
        if (pos < (int32_t)startAB)
            pos = startAB;
        if (pos >= (int32_t)endAB)
            pos = endAB;
        setFilePos(pos);
        return true;
    }
    return false;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setFilePos(uint32_t pos)
{
    if (m_codec == CODEC_OPUS)
        return false; // not impl. yet
    if (m_codec == CODEC_VORBIS)
        return false; // not impl. yet
    if (!audiofile)
        return false;
    if (pos < m_audioDataStart)
        pos = m_audioDataStart; // issue #96
    if (pos > m_file_size)
        pos = m_file_size;
    m_resumeFilePos = pos;
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::audioFileSeek(const float speed)
{
    // 0.5 is half speed
    // 1.0 is normal speed
    // 1.5 is one and half speed
    if ((speed > 1.5f) || (speed < 0.25f))
        return false;

    uint32_t srate = getSampleRate() * speed;
    i2s_set_sample_rates((i2s_port_t)m_i2s_num, srate);
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setSampleRate(uint32_t sampRate)
{
    if (!sampRate)
        sampRate = 16000; // fuse, if there is no value -> set default #209
    i2s_set_sample_rates((i2s_port_t)m_i2s_num, sampRate);
    m_sampleRate = sampRate;
    IIR_calculateCoefficients(m_gain0, m_gain1, m_gain2); // must be recalculated after each samplerate change
    return true;
}
uint32_t AudioHelpr::getSampleRate()
{
    return m_sampleRate;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setBitsPerSample(int bits)
{
    if ((bits != 16) && (bits != 8))
        return false;
    m_bitsPerSample = bits;
    return true;
}
uint8_t AudioHelpr::getBitsPerSample()
{
    return m_bitsPerSample;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setChannels(int ch)
{
    if ((ch < 1) || (ch > 2))
        return false;
    m_channels = ch;
    return true;
}
uint8_t AudioHelpr::getChannels()
{
    if (m_channels == 0) { // this should not happen! #209
        m_channels = 2;
    }
    return m_channels;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::setBitrate(int br)
{
    m_bitRate = br;
    if (br)
        return true;
    return false;
}
uint32_t AudioHelpr::getBitRate(bool avg)
{
    if (avg)
        return m_avr_bitrate;
    return m_bitRate;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setI2SCommFMT_LSB(bool commFMT)
{
    // false: I2S communication format is by default I2S_COMM_FORMAT_I2S_MSB, right->left (AC101, PCM5102A)
    // true:  changed to I2S_COMM_FORMAT_I2S_LSB for some DACs (PT8211)
    //        Japanese or called LSBJ (Least Significant Bit Justified) format

    if (commFMT) {
        if (m_f_Log)
            log_i("commFMT LSB");

#if ESP_ARDUINO_VERSION_MAJOR >= 2
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_MSB); // v >= 2.0.0
#else
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_LSB);
#endif
    } else {
        if (m_f_Log)
            log_i("commFMT MSB");

#if ESP_ARDUINO_VERSION_MAJOR >= 2
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // vers >= 2.0.0
#else
        m_i2s_config.communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB);
#endif
    }
    AUDIO_INFO("commFMT = %i", m_i2s_config.communication_format);
    i2s_driver_uninstall((i2s_port_t)m_i2s_num);
    i2s_driver_install((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::computeVUlevel(int16_t sample[2])
{
    static uint8_t sampleArray[2][4][8] = {0};
    static uint8_t cnt0 = 0, cnt1 = 0, cnt2 = 0, cnt3 = 0, cnt4 = 0;
    static bool f_vu = false;

