1002cc/Smart_Home_ESP32/smartHome_esp32/src/audiohelpr.cpp
    auto avg = [&](uint8_t *sampArr) { // lambda, inner function, compute the average of 8 samples
        uint16_t av = 0;
        for (int i = 0; i < 8; i++) {
            av += sampArr[i];
        }
        return av >> 3;
    };

    auto largest = [&](uint8_t *sampArr) { // lambda, inner function, compute the largest of 8 samples
        uint16_t maxValue = 0;
        for (int i = 0; i < 8; i++) {
            if (maxValue < sampArr[i])
                maxValue = sampArr[i];
        }
        return maxValue;
    };

    if (cnt0 == 64) {
        cnt0 = 0;
        cnt1++;
    }
    if (cnt1 == 8) {
        cnt1 = 0;
        cnt2++;
    }
    if (cnt2 == 8) {
        cnt2 = 0;
        cnt3++;
    }
    if (cnt3 == 8) {
        cnt3 = 0;
        cnt4++;
        f_vu = true;
    }
    if (cnt4 == 8) {
        cnt4 = 0;
    }

    if (!cnt0) { // store every 64th sample in the array[0]
        sampleArray[LEFTCHANNEL][0][cnt1] = abs(sample[LEFTCHANNEL] >> 7);
        sampleArray[RIGHTCHANNEL][0][cnt1] = abs(sample[RIGHTCHANNEL] >> 7);
    }
    if (!cnt1) { // store argest from 64 * 8 samples in the array[1]
        sampleArray[LEFTCHANNEL][1][cnt2] = largest(sampleArray[LEFTCHANNEL][0]);
        sampleArray[RIGHTCHANNEL][1][cnt2] = largest(sampleArray[RIGHTCHANNEL][0]);
    }
    if (!cnt2) { // store avg from 64 * 8 * 8 samples in the array[2]
        sampleArray[LEFTCHANNEL][2][cnt3] = largest(sampleArray[LEFTCHANNEL][1]);
        sampleArray[RIGHTCHANNEL][2][cnt3] = largest(sampleArray[RIGHTCHANNEL][1]);
    }
    if (!cnt3) { // store avg from 64 * 8 * 8 * 8 samples in the array[3]
        sampleArray[LEFTCHANNEL][3][cnt4] = avg(sampleArray[LEFTCHANNEL][2]);
        sampleArray[RIGHTCHANNEL][3][cnt4] = avg(sampleArray[RIGHTCHANNEL][2]);
    }
    if (f_vu) {
        f_vu = false;
        m_vuLeft = avg(sampleArray[LEFTCHANNEL][3]);
        m_vuRight = avg(sampleArray[RIGHTCHANNEL][3]);
    }
    cnt1++;
}
//---------------------------------------------------------------------------------------------------------------------
uint16_t AudioHelpr::getVUlevel()
{
    // avg 0 ... 127
    if (!m_f_running)
        return 0;
    return (m_vuLeft << 8) + m_vuRight;
}
//---------------------------------------------------------------------------------------------------------------------
bool AudioHelpr::playSample(int16_t sample[2])
{

    if (getBitsPerSample() == 8) { // Upsample from unsigned 8 bits to signed 16 bits
        sample[LEFTCHANNEL] = ((sample[LEFTCHANNEL] & 0xff) - 128) << 8;
        sample[RIGHTCHANNEL] = ((sample[RIGHTCHANNEL] & 0xff) - 128) << 8;
    }

    // set a correction factor if filter have positive amplification
    if (m_corr > 1) {
        sample[LEFTCHANNEL] = sample[LEFTCHANNEL] / m_corr;
        sample[RIGHTCHANNEL] = sample[RIGHTCHANNEL] / m_corr;
    }

    computeVUlevel(sample);

    // Filterchain, can commented out if not used
    sample = IIR_filterChain0(sample);
    sample = IIR_filterChain1(sample);
    sample = IIR_filterChain2(sample);
    //-------------------------------------------

    uint32_t s32 = Gain(sample); // vosample2lume;

    if (audio_process_i2s) {
        // process audio sample just before writing to i2s
        bool continueI2S = false;
        audio_process_i2s(&s32, &continueI2S);
        if (!continueI2S) {
            return true;
        }
    }

    if (m_f_internalDAC) {
        s32 += 0x80008000;
    }
    m_i2s_bytesWritten = 0;
    esp_err_t err = i2s_write((i2s_port_t)m_i2s_num, (const char *)&s32, sizeof(uint32_t), &m_i2s_bytesWritten, 100);
    if (err != ESP_OK) {
        log_e("ESP32 Errorcode %i", err);
        return false;
    }
    if (m_i2s_bytesWritten < 4) {
        log_e("Can't stuff any more in I2S..."); // increase waitingtime or outputbuffer
        return false;
    }
    return true;
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setTone(int8_t gainLowPass, int8_t gainBandPass, int8_t gainHighPass)
{
    // see https://www.earlevel.com/main/2013/10/13/biquad-calculator-v2/
    // values can be between -40 ... +6 (dB)

    m_gain0 = gainLowPass;
    m_gain1 = gainBandPass;
    m_gain2 = gainHighPass;

    // gain, attenuation (set in digital filters)
    int db = max(m_gain0, max(m_gain1, m_gain2));
    m_corr = pow10f((float)db / 20);

    IIR_calculateCoefficients(m_gain0, m_gain1, m_gain2);

    /*
        This will cause a clicking sound when adjusting the EQ.
        Because when the EQ is adjusted, the IIR filter will be cleared and played,
        mixed in the audio data frame, and a click-like sound will be produced.
    */
    /*
    int16_t tmp[2]; tmp[0] = 0; tmp[1]= 0;

    IIR_filterChain0(tmp, true ); // flush the filter
    IIR_filterChain1(tmp, true ); // flush the filter
    IIR_filterChain2(tmp, true ); // flush the filter
    */
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::forceMono(bool m)
{                      // #100 mono option
    m_f_forceMono = m; // false stereo, true mono
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setBalance(int8_t bal)
{ // bal -16...16
    if (bal < -16)
        bal = -16;
    if (bal > 16)
        bal = 16;
    m_balance = bal;

    computeLimit();
}
//---------------------------------------------------------------------------------------------------------------------
void AudioHelpr::setVolume(uint8_t vol, uint8_t curve)
{ // curve 0: default, curve 1: flat at the beginning
    if (vol > m_vol_steps)
        m_vol = m_vol_steps;
    else
        m_vol = vol;

    if (curve > 1)
        m_curve = 1;
    else
        m_curve = curve;

    computeLimit(); // 调整音量大小
}
//---------------------------------------------------------------------------------------------------------------------
uint8_t AudioHelpr::getVolume()
{
    return m_vol;
}
//---------------------------------------------------------------------------------------------------------------------
uint8_t AudioHelpr::getI2sPort()
{
    return m_i2s_num;
}
void AudioHelpr::setPerid(int perid)
{
    m_perid = perid;
}

int AudioHelpr::getPerid()
{
    return m_perid;
}

